/* area.js for item.default,item.worldbuy begin */
function common_getAreaMap() {
    var common_areaMap = {
        data: {
            '0': {
                "1": [
                    {
                        "id": 72,
                        "name": "朝阳区"
                    },
                    {
                        "id": 2800,
                        "name": "海淀区"
                    },
                    {
                        "id": 2801,
                        "name": "西城区"
                    },
                    {
                        "id": 2802,
                        "name": "东城区"
                    },
                    {
                        "id": 2803,
                        "name": "崇文区"
                    },
                    {
                        "id": 2804,
                        "name": "宣武区"
                    },
                    {
                        "id": 2805,
                        "name": "丰台区"
                    },
                    {
                        "id": 2806,
                        "name": "石景山区"
                    },
                    {
                        "id": 2807,
                        "name": "门头沟"
                    },
                    {
                        "id": 2808,
                        "name": "房山区"
                    },
                    {
                        "id": 2809,
                        "name": "通州区"
                    },
                    {
                        "id": 2810,
                        "name": "大兴区"
                    },
                    {
                        "id": 2812,
                        "name": "顺义区"
                    },
                    {
                        "id": 2814,
                        "name": "怀柔区"
                    },
                    {
                        "id": 2816,
                        "name": "密云区"
                    },
                    {
                        "id": 2901,
                        "name": "昌平区"
                    },
                    {
                        "id": 2953,
                        "name": "平谷区"
                    },
                    {
                        "id": 3065,
                        "name": "延庆县"
                    }
                ],
                "2": [
                    {
                        "id": 78,
                        "name": "黄浦区"
                    },
                    {
                        "id": 2813,
                        "name": "徐汇区"
                    },
                    {
                        "id": 2815,
                        "name": "长宁区"
                    },
                    {
                        "id": 2817,
                        "name": "静安区"
                    },
                    {
                        "id": 2820,
                        "name": "闸北区"
                    },
                    {
                        "id": 2822,
                        "name": "虹口区"
                    },
                    {
                        "id": 2823,
                        "name": "杨浦区"
                    },
                    {
                        "id": 2824,
                        "name": "宝山区"
                    },
                    {
                        "id": 2825,
                        "name": "闵行区"
                    },
                    {
                        "id": 2826,
                        "name": "嘉定区"
                    },
                    {
                        "id": 2830,
                        "name": "浦东新区"
                    },
                    {
                        "id": 2833,
                        "name": "青浦区"
                    },
                    {
                        "id": 2834,
                        "name": "松江区"
                    },
                    {
                        "id": 2835,
                        "name": "金山区"
                    },
                    {
                        "id": 2837,
                        "name": "奉贤区"
                    },
                    {
                        "id": 2841,
                        "name": "普陀区"
                    },
                    {
                        "id": 2919,
                        "name": "崇明县"
                    }
                ],
                "3": [
                    {
                        "id": 51035,
                        "name": "东丽区"
                    },
                    {
                        "id": 51036,
                        "name": "和平区"
                    },
                    {
                        "id": 51037,
                        "name": "河北区"
                    },
                    {
                        "id": 51038,
                        "name": "河东区"
                    },
                    {
                        "id": 51039,
                        "name": "河西区"
                    },
                    {
                        "id": 51040,
                        "name": "红桥区"
                    },
                    {
                        "id": 51041,
                        "name": "蓟县"
                    },
                    {
                        "id": 51042,
                        "name": "静海县"
                    },
                    {
                        "id": 51043,
                        "name": "南开区"
                    },
                    {
                        "id": 51044,
                        "name": "塘沽区"
                    },
                    {
                        "id": 51045,
                        "name": "西青区"
                    },
                    {
                        "id": 51046,
                        "name": "武清区"
                    },
                    {
                        "id": 51047,
                        "name": "津南区"
                    },
                    {
                        "id": 51048,
                        "name": "汉沽区"
                    },
                    {
                        "id": 51049,
                        "name": "大港区"
                    },
                    {
                        "id": 51050,
                        "name": "北辰区"
                    },
                    {
                        "id": 51051,
                        "name": "宝坻区"
                    },
                    {
                        "id": 51052,
                        "name": "宁河县"
                    }
                ],
                "4": [
                    {
                        "id": 113,
                        "name": "万州区"
                    },
                    {
                        "id": 114,
                        "name": "涪陵区"
                    },
                    {
                        "id": 115,
                        "name": "梁平区"
                    },
                    {
                        "id": 119,
                        "name": "南川区"
                    },
                    {
                        "id": 123,
                        "name": "潼南区"
                    },
                    {
                        "id": 126,
                        "name": "大足区"
                    },
                    {
                        "id": 128,
                        "name": "黔江区"
                    },
                    {
                        "id": 129,
                        "name": "武隆区"
                    },
                    {
                        "id": 130,
                        "name": "丰都县"
                    },
                    {
                        "id": 131,
                        "name": "奉节县"
                    },
                    {
                        "id": 132,
                        "name": "开州区"
                    },
                    {
                        "id": 133,
                        "name": "云阳县"
                    },
                    {
                        "id": 134,
                        "name": "忠县"
                    },
                    {
                        "id": 135,
                        "name": "巫溪县"
                    },
                    {
                        "id": 136,
                        "name": "巫山县"
                    },
                    {
                        "id": 137,
                        "name": "石柱县"
                    },
                    {
                        "id": 138,
                        "name": "彭水县"
                    },
                    {
                        "id": 139,
                        "name": "垫江县"
                    },
                    {
                        "id": 140,
                        "name": "酉阳县"
                    },
                    {
                        "id": 141,
                        "name": "秀山县"
                    },
                    {
                        "id": 4164,
                        "name": "城口县"
                    },
                    {
                        "id": 48131,
                        "name": "璧山区"
                    },
                    {
                        "id": 48132,
                        "name": "荣昌区"
                    },
                    {
                        "id": 48133,
                        "name": "铜梁区"
                    },
                    {
                        "id": 48201,
                        "name": "合川区"
                    },
                    {
                        "id": 48202,
                        "name": "巴南区"
                    },
                    {
                        "id": 48203,
                        "name": "北碚区"
                    },
                    {
                        "id": 48204,
                        "name": "江津区"
                    },
                    {
                        "id": 48205,
                        "name": "渝北区"
                    },
                    {
                        "id": 48206,
                        "name": "长寿区"
                    },
                    {
                        "id": 48207,
                        "name": "永川区"
                    },
                    {
                        "id": 50950,
                        "name": "江北区"
                    },
                    {
                        "id": 50951,
                        "name": "南岸区"
                    },
                    {
                        "id": 50952,
                        "name": "九龙坡区"
                    },
                    {
                        "id": 50953,
                        "name": "沙坪坝区"
                    },
                    {
                        "id": 50954,
                        "name": "大渡口区"
                    },
                    {
                        "id": 50995,
                        "name": "綦江区"
                    },
                    {
                        "id": 51026,
                        "name": "渝中区"
                    },
                    {
                        "id": 51027,
                        "name": "高新区"
                    },
                    {
                        "id": 51028,
                        "name": "北部新区"
                    }
                ],
                "5": [
                    {
                        "id": 142,
                        "name": "石家庄市"
                    },
                    {
                        "id": 148,
                        "name": "邯郸市"
                    },
                    {
                        "id": 164,
                        "name": "邢台市"
                    },
                    {
                        "id": 199,
                        "name": "保定市"
                    },
                    {
                        "id": 224,
                        "name": "张家口市"
                    },
                    {
                        "id": 239,
                        "name": "承德市"
                    },
                    {
                        "id": 248,
                        "name": "秦皇岛市"
                    },
                    {
                        "id": 258,
                        "name": "唐山市"
                    },
                    {
                        "id": 264,
                        "name": "沧州市"
                    },
                    {
                        "id": 274,
                        "name": "廊坊市"
                    },
                    {
                        "id": 275,
                        "name": "衡水市"
                    }
                ],
                "6": [
                    {
                        "id": 303,
                        "name": "太原市"
                    },
                    {
                        "id": 309,
                        "name": "大同市"
                    },
                    {
                        "id": 318,
                        "name": "阳泉市"
                    },
                    {
                        "id": 325,
                        "name": "晋城市"
                    },
                    {
                        "id": 330,
                        "name": "朔州市"
                    },
                    {
                        "id": 336,
                        "name": "晋中市"
                    },
                    {
                        "id": 350,
                        "name": "忻州市"
                    },
                    {
                        "id": 368,
                        "name": "吕梁市"
                    },
                    {
                        "id": 379,
                        "name": "临汾市"
                    },
                    {
                        "id": 398,
                        "name": "运城市"
                    },
                    {
                        "id": 3074,
                        "name": "长治市"
                    }
                ],
                "7": [
                    {
                        "id": 412,
                        "name": "郑州市"
                    },
                    {
                        "id": 420,
                        "name": "开封市"
                    },
                    {
                        "id": 427,
                        "name": "洛阳市"
                    },
                    {
                        "id": 438,
                        "name": "平顶山市"
                    },
                    {
                        "id": 446,
                        "name": "焦作市"
                    },
                    {
                        "id": 454,
                        "name": "鹤壁市"
                    },
                    {
                        "id": 458,
                        "name": "新乡市"
                    },
                    {
                        "id": 468,
                        "name": "安阳市"
                    },
                    {
                        "id": 475,
                        "name": "濮阳市"
                    },
                    {
                        "id": 482,
                        "name": "许昌市"
                    },
                    {
                        "id": 489,
                        "name": "漯河市"
                    },
                    {
                        "id": 495,
                        "name": "三门峡市"
                    },
                    {
                        "id": 502,
                        "name": "南阳市"
                    },
                    {
                        "id": 517,
                        "name": "商丘市"
                    },
                    {
                        "id": 527,
                        "name": "周口市"
                    },
                    {
                        "id": 538,
                        "name": "驻马店市"
                    },
                    {
                        "id": 549,
                        "name": "信阳市"
                    },
                    {
                        "id": 2780,
                        "name": "济源市"
                    }
                ],
                "8": [
                    {
                        "id": 560,
                        "name": "沈阳市"
                    },
                    {
                        "id": 573,
                        "name": "大连市"
                    },
                    {
                        "id": 579,
                        "name": "鞍山市"
                    },
                    {
                        "id": 584,
                        "name": "抚顺市"
                    },
                    {
                        "id": 589,
                        "name": "本溪市"
                    },
                    {
                        "id": 593,
                        "name": "丹东市"
                    },
                    {
                        "id": 598,
                        "name": "锦州市"
                    },
                    {
                        "id": 604,
                        "name": "葫芦岛市"
                    },
                    {
                        "id": 609,
                        "name": "营口市"
                    },
                    {
                        "id": 613,
                        "name": "盘锦市"
                    },
                    {
                        "id": 617,
                        "name": "阜新市"
                    },
                    {
                        "id": 621,
                        "name": "辽阳市"
                    },
                    {
                        "id": 632,
                        "name": "朝阳市"
                    },
                    {
                        "id": 6858,
                        "name": "铁岭市"
                    }
                ],
                "9": [
                    {
                        "id": 639,
                        "name": "长春市"
                    },
                    {
                        "id": 644,
                        "name": "吉林市"
                    },
                    {
                        "id": 651,
                        "name": "四平市"
                    },
                    {
                        "id": 657,
                        "name": "通化市"
                    },
                    {
                        "id": 664,
                        "name": "白山市"
                    },
                    {
                        "id": 674,
                        "name": "松原市"
                    },
                    {
                        "id": 681,
                        "name": "白城市"
                    },
                    {
                        "id": 687,
                        "name": "延边州"
                    },
                    {
                        "id": 2992,
                        "name": "辽源市"
                    }
                ],
                "10": [
                    {
                        "id": 698,
                        "name": "哈尔滨市"
                    },
                    {
                        "id": 712,
                        "name": "齐齐哈尔市"
                    },
                    {
                        "id": 727,
                        "name": "鹤岗市"
                    },
                    {
                        "id": 731,
                        "name": "双鸭山市"
                    },
                    {
                        "id": 737,
                        "name": "鸡西市"
                    },
                    {
                        "id": 742,
                        "name": "大庆市"
                    },
                    {
                        "id": 753,
                        "name": "伊春市"
                    },
                    {
                        "id": 757,
                        "name": "牡丹江市"
                    },
                    {
                        "id": 765,
                        "name": "佳木斯市"
                    },
                    {
                        "id": 773,
                        "name": "七台河市"
                    },
                    {
                        "id": 776,
                        "name": "黑河市"
                    },
                    {
                        "id": 782,
                        "name": "绥化市"
                    },
                    {
                        "id": 793,
                        "name": "大兴安岭地区"
                    }
                ],
                "11": [
                    {
                        "id": 799,
                        "name": "呼和浩特市"
                    },
                    {
                        "id": 805,
                        "name": "包头市"
                    },
                    {
                        "id": 810,
                        "name": "乌海市"
                    },
                    {
                        "id": 812,
                        "name": "赤峰市"
                    },
                    {
                        "id": 823,
                        "name": "乌兰察布市"
                    },
                    {
                        "id": 835,
                        "name": "锡林郭勒盟"
                    },
                    {
                        "id": 848,
                        "name": "呼伦贝尔市"
                    },
                    {
                        "id": 870,
                        "name": "鄂尔多斯市"
                    },
                    {
                        "id": 880,
                        "name": "巴彦淖尔市"
                    },
                    {
                        "id": 891,
                        "name": "阿拉善盟"
                    },
                    {
                        "id": 895,
                        "name": "兴安盟"
                    },
                    {
                        "id": 902,
                        "name": "通辽市"
                    }
                ],
                "12": [
                    {
                        "id": 904,
                        "name": "南京市"
                    },
                    {
                        "id": 911,
                        "name": "徐州市"
                    },
                    {
                        "id": 919,
                        "name": "连云港市"
                    },
                    {
                        "id": 925,
                        "name": "淮安市"
                    },
                    {
                        "id": 933,
                        "name": "宿迁市"
                    },
                    {
                        "id": 939,
                        "name": "盐城市"
                    },
                    {
                        "id": 951,
                        "name": "扬州市"
                    },
                    {
                        "id": 959,
                        "name": "泰州市"
                    },
                    {
                        "id": 965,
                        "name": "南通市"
                    },
                    {
                        "id": 972,
                        "name": "镇江市"
                    },
                    {
                        "id": 978,
                        "name": "常州市"
                    },
                    {
                        "id": 984,
                        "name": "无锡市"
                    },
                    {
                        "id": 988,
                        "name": "苏州市"
                    }
                ],
                "13": [
                    {
                        "id": 1000,
                        "name": "济南市"
                    },
                    {
                        "id": 1007,
                        "name": "青岛市"
                    },
                    {
                        "id": 1016,
                        "name": "淄博市"
                    },
                    {
                        "id": 1022,
                        "name": "枣庄市"
                    },
                    {
                        "id": 1025,
                        "name": "东营市"
                    },
                    {
                        "id": 1032,
                        "name": "潍坊市"
                    },
                    {
                        "id": 1042,
                        "name": "烟台市"
                    },
                    {
                        "id": 1053,
                        "name": "威海市"
                    },
                    {
                        "id": 1058,
                        "name": "莱芜市"
                    },
                    {
                        "id": 1060,
                        "name": "德州市"
                    },
                    {
                        "id": 1072,
                        "name": "临沂市"
                    },
                    {
                        "id": 1081,
                        "name": "聊城市"
                    },
                    {
                        "id": 1090,
                        "name": "滨州市"
                    },
                    {
                        "id": 1099,
                        "name": "菏泽市"
                    },
                    {
                        "id": 1108,
                        "name": "日照市"
                    },
                    {
                        "id": 1112,
                        "name": "泰安市"
                    },
                    {
                        "id": 2900,
                        "name": "济宁市"
                    }
                ],
                "14": [
                    {
                        "id": 1114,
                        "name": "铜陵市"
                    },
                    {
                        "id": 1116,
                        "name": "合肥市"
                    },
                    {
                        "id": 1121,
                        "name": "淮南市"
                    },
                    {
                        "id": 1124,
                        "name": "淮北市"
                    },
                    {
                        "id": 1127,
                        "name": "芜湖市"
                    },
                    {
                        "id": 1132,
                        "name": "蚌埠市"
                    },
                    {
                        "id": 1137,
                        "name": "马鞍山市"
                    },
                    {
                        "id": 1140,
                        "name": "安庆市"
                    },
                    {
                        "id": 1151,
                        "name": "黄山市"
                    },
                    {
                        "id": 1159,
                        "name": "滁州市"
                    },
                    {
                        "id": 1167,
                        "name": "阜阳市"
                    },
                    {
                        "id": 1174,
                        "name": "亳州市"
                    },
                    {
                        "id": 1180,
                        "name": "宿州市"
                    },
                    {
                        "id": 1201,
                        "name": "池州市"
                    },
                    {
                        "id": 1206,
                        "name": "六安市"
                    },
                    {
                        "id": 2971,
                        "name": "宣城市"
                    }
                ],
                "15": [
                    {
                        "id": 1158,
                        "name": "宁波市"
                    },
                    {
                        "id": 1213,
                        "name": "杭州市"
                    },
                    {
                        "id": 1233,
                        "name": "温州市"
                    },
                    {
                        "id": 1243,
                        "name": "嘉兴市"
                    },
                    {
                        "id": 1250,
                        "name": "湖州市"
                    },
                    {
                        "id": 1255,
                        "name": "绍兴市"
                    },
                    {
                        "id": 1262,
                        "name": "金华市"
                    },
                    {
                        "id": 1273,
                        "name": "衢州市"
                    },
                    {
                        "id": 1280,
                        "name": "丽水市"
                    },
                    {
                        "id": 1290,
                        "name": "台州市"
                    },
                    {
                        "id": 1298,
                        "name": "舟山市"
                    }
                ],
                "16": [
                    {
                        "id": 1303,
                        "name": "福州市"
                    },
                    {
                        "id": 1315,
                        "name": "厦门市"
                    },
                    {
                        "id": 1317,
                        "name": "三明市"
                    },
                    {
                        "id": 1329,
                        "name": "莆田市"
                    },
                    {
                        "id": 1332,
                        "name": "泉州市"
                    },
                    {
                        "id": 1341,
                        "name": "漳州市"
                    },
                    {
                        "id": 1352,
                        "name": "南平市"
                    },
                    {
                        "id": 1362,
                        "name": "龙岩市"
                    },
                    {
                        "id": 1370,
                        "name": "宁德市"
                    }
                ],
                "17": [
                    {
                        "id": 1381,
                        "name": "武汉市"
                    },
                    {
                        "id": 1387,
                        "name": "黄石市"
                    },
                    {
                        "id": 1396,
                        "name": "襄阳市"
                    },
                    {
                        "id": 1405,
                        "name": "十堰市"
                    },
                    {
                        "id": 1413,
                        "name": "荆州市"
                    },
                    {
                        "id": 1421,
                        "name": "宜昌市"
                    },
                    {
                        "id": 1432,
                        "name": "孝感市"
                    },
                    {
                        "id": 1441,
                        "name": "黄冈市"
                    },
                    {
                        "id": 1458,
                        "name": "咸宁市"
                    },
                    {
                        "id": 1466,
                        "name": "恩施州"
                    },
                    {
                        "id": 1475,
                        "name": "鄂州市"
                    },
                    {
                        "id": 1477,
                        "name": "荆门市"
                    },
                    {
                        "id": 1479,
                        "name": "随州市"
                    },
                    {
                        "id": 2922,
                        "name": "潜江市"
                    },
                    {
                        "id": 2980,
                        "name": "天门市"
                    },
                    {
                        "id": 2983,
                        "name": "仙桃市"
                    },
                    {
                        "id": 3154,
                        "name": "神农架林区"
                    }
                ],
                "18": [
                    {
                        "id": 1482,
                        "name": "长沙市"
                    },
                    {
                        "id": 1488,
                        "name": "株洲市"
                    },
                    {
                        "id": 1495,
                        "name": "湘潭市"
                    },
                    {
                        "id": 1501,
                        "name": "衡阳市"
                    },
                    {
                        "id": 1511,
                        "name": "邵阳市"
                    },
                    {
                        "id": 1522,
                        "name": "岳阳市"
                    },
                    {
                        "id": 1530,
                        "name": "常德市"
                    },
                    {
                        "id": 1540,
                        "name": "张家界市"
                    },
                    {
                        "id": 1544,
                        "name": "郴州市"
                    },
                    {
                        "id": 1555,
                        "name": "益阳市"
                    },
                    {
                        "id": 1560,
                        "name": "永州市"
                    },
                    {
                        "id": 1574,
                        "name": "怀化市"
                    },
                    {
                        "id": 1586,
                        "name": "娄底市"
                    },
                    {
                        "id": 1592,
                        "name": "湘西州"
                    }
                ],
                "19": [
                    {
                        "id": 1601,
                        "name": "广州市"
                    },
                    {
                        "id": 1607,
                        "name": "深圳市"
                    },
                    {
                        "id": 1609,
                        "name": "珠海市"
                    },
                    {
                        "id": 1611,
                        "name": "汕头市"
                    },
                    {
                        "id": 1617,
                        "name": "韶关市"
                    },
                    {
                        "id": 1627,
                        "name": "河源市"
                    },
                    {
                        "id": 1634,
                        "name": "梅州市"
                    },
                    {
                        "id": 1643,
                        "name": "惠州市"
                    },
                    {
                        "id": 1650,
                        "name": "汕尾市"
                    },
                    {
                        "id": 1655,
                        "name": "东莞市"
                    },
                    {
                        "id": 1657,
                        "name": "中山市"
                    },
                    {
                        "id": 1659,
                        "name": "江门市"
                    },
                    {
                        "id": 1666,
                        "name": "佛山市"
                    },
                    {
                        "id": 1672,
                        "name": "阳江市"
                    },
                    {
                        "id": 1677,
                        "name": "湛江市"
                    },
                    {
                        "id": 1684,
                        "name": "茂名市"
                    },
                    {
                        "id": 1690,
                        "name": "肇庆市"
                    },
                    {
                        "id": 1698,
                        "name": "云浮市"
                    },
                    {
                        "id": 1704,
                        "name": "清远市"
                    },
                    {
                        "id": 1705,
                        "name": "潮州市"
                    },
                    {
                        "id": 1709,
                        "name": "揭阳市"
                    }
                ],
                "20": [
                    {
                        "id": 1715,
                        "name": "南宁市"
                    },
                    {
                        "id": 1720,
                        "name": "柳州市"
                    },
                    {
                        "id": 1726,
                        "name": "桂林市"
                    },
                    {
                        "id": 1740,
                        "name": "梧州市"
                    },
                    {
                        "id": 1746,
                        "name": "北海市"
                    },
                    {
                        "id": 1749,
                        "name": "防城港市"
                    },
                    {
                        "id": 1753,
                        "name": "钦州市"
                    },
                    {
                        "id": 1757,
                        "name": "贵港市"
                    },
                    {
                        "id": 1761,
                        "name": "玉林市"
                    },
                    {
                        "id": 1792,
                        "name": "贺州市"
                    },
                    {
                        "id": 1806,
                        "name": "百色市"
                    },
                    {
                        "id": 1818,
                        "name": "河池市"
                    },
                    {
                        "id": 3044,
                        "name": "来宾市"
                    },
                    {
                        "id": 3168,
                        "name": "崇左市"
                    }
                ],
                "21": [
                    {
                        "id": 1827,
                        "name": "南昌市"
                    },
                    {
                        "id": 1832,
                        "name": "景德镇市"
                    },
                    {
                        "id": 1836,
                        "name": "萍乡市"
                    },
                    {
                        "id": 1842,
                        "name": "新余市"
                    },
                    {
                        "id": 1845,
                        "name": "九江市"
                    },
                    {
                        "id": 1857,
                        "name": "鹰潭市"
                    },
                    {
                        "id": 1861,
                        "name": "上饶市"
                    },
                    {
                        "id": 1874,
                        "name": "宜春市"
                    },
                    {
                        "id": 1885,
                        "name": "抚州市"
                    },
                    {
                        "id": 1898,
                        "name": "吉安市"
                    },
                    {
                        "id": 1911,
                        "name": "赣州市"
                    }
                ],
                "22": [
                    {
                        "id": 1930,
                        "name": "成都市"
                    },
                    {
                        "id": 1946,
                        "name": "自贡市"
                    },
                    {
                        "id": 1950,
                        "name": "攀枝花市"
                    },
                    {
                        "id": 1954,
                        "name": "泸州市"
                    },
                    {
                        "id": 1960,
                        "name": "绵阳市"
                    },
                    {
                        "id": 1962,
                        "name": "德阳市"
                    },
                    {
                        "id": 1977,
                        "name": "广元市"
                    },
                    {
                        "id": 1983,
                        "name": "遂宁市"
                    },
                    {
                        "id": 1988,
                        "name": "内江市"
                    },
                    {
                        "id": 1993,
                        "name": "乐山市"
                    },
                    {
                        "id": 2005,
                        "name": "宜宾市"
                    },
                    {
                        "id": 2016,
                        "name": "广安市"
                    },
                    {
                        "id": 2022,
                        "name": "南充市"
                    },
                    {
                        "id": 2033,
                        "name": "达州市"
                    },
                    {
                        "id": 2042,
                        "name": "巴中市"
                    },
                    {
                        "id": 2047,
                        "name": "雅安市"
                    },
                    {
                        "id": 2058,
                        "name": "眉山市"
                    },
                    {
                        "id": 2065,
                        "name": "资阳市"
                    },
                    {
                        "id": 2070,
                        "name": "阿坝州"
                    },
                    {
                        "id": 2084,
                        "name": "甘孜州"
                    },
                    {
                        "id": 2103,
                        "name": "凉山州"
                    }
                ],
                "23": [
                    {
                        "id": 2121,
                        "name": "海口市"
                    },
                    {
                        "id": 3034,
                        "name": "儋州市"
                    },
                    {
                        "id": 3115,
                        "name": "琼海市"
                    },
                    {
                        "id": 3137,
                        "name": "万宁市"
                    },
                    {
                        "id": 3173,
                        "name": "东方市"
                    },
                    {
                        "id": 3690,
                        "name": "三亚市"
                    },
                    {
                        "id": 3698,
                        "name": "文昌市"
                    },
                    {
                        "id": 3699,
                        "name": "五指山市"
                    },
                    {
                        "id": 3701,
                        "name": "临高县"
                    },
                    {
                        "id": 3702,
                        "name": "澄迈县"
                    },
                    {
                        "id": 3703,
                        "name": "定安县"
                    },
                    {
                        "id": 3704,
                        "name": "屯昌县"
                    },
                    {
                        "id": 3705,
                        "name": "昌江县"
                    },
                    {
                        "id": 3706,
                        "name": "白沙县"
                    },
                    {
                        "id": 3707,
                        "name": "琼中县"
                    },
                    {
                        "id": 3708,
                        "name": "陵水县"
                    },
                    {
                        "id": 3709,
                        "name": "保亭县"
                    },
                    {
                        "id": 3710,
                        "name": "乐东县"
                    },
                    {
                        "id": 3711,
                        "name": "三沙市"
                    }
                ],
                "24": [
                    {
                        "id": 2144,
                        "name": "贵阳市"
                    },
                    {
                        "id": 2150,
                        "name": "六盘水市"
                    },
                    {
                        "id": 2155,
                        "name": "遵义市"
                    },
                    {
                        "id": 2169,
                        "name": "铜仁市"
                    },
                    {
                        "id": 2180,
                        "name": "毕节市"
                    },
                    {
                        "id": 2189,
                        "name": "安顺市"
                    },
                    {
                        "id": 2196,
                        "name": "黔西南州"
                    },
                    {
                        "id": 2205,
                        "name": "黔东南州"
                    },
                    {
                        "id": 2222,
                        "name": "黔南州"
                    }
                ],
                "25": [
                    {
                        "id": 2235,
                        "name": "昆明市"
                    },
                    {
                        "id": 2247,
                        "name": "曲靖市"
                    },
                    {
                        "id": 2258,
                        "name": "玉溪市"
                    },
                    {
                        "id": 2270,
                        "name": "昭通市"
                    },
                    {
                        "id": 2281,
                        "name": "普洱市"
                    },
                    {
                        "id": 2291,
                        "name": "临沧市"
                    },
                    {
                        "id": 2298,
                        "name": "保山市"
                    },
                    {
                        "id": 2304,
                        "name": "丽江市"
                    },
                    {
                        "id": 2309,
                        "name": "文山州"
                    },
                    {
                        "id": 2318,
                        "name": "红河州"
                    },
                    {
                        "id": 2332,
                        "name": "西双版纳州"
                    },
                    {
                        "id": 2336,
                        "name": "楚雄州"
                    },
                    {
                        "id": 2347,
                        "name": "大理州"
                    },
                    {
                        "id": 2360,
                        "name": "德宏州"
                    },
                    {
                        "id": 2366,
                        "name": "怒江州"
                    },
                    {
                        "id": 4108,
                        "name": "迪庆州"
                    }
                ],
                "26": [
                    {
                        "id": 2951,
                        "name": "拉萨市"
                    },
                    {
                        "id": 3107,
                        "name": "那曲地区"
                    },
                    {
                        "id": 3129,
                        "name": "山南地区"
                    },
                    {
                        "id": 3138,
                        "name": "昌都地区"
                    },
                    {
                        "id": 3144,
                        "name": "日喀则地区"
                    },
                    {
                        "id": 3970,
                        "name": "阿里地区"
                    },
                    {
                        "id": 3971,
                        "name": "林芝市"
                    }
                ],
                "27": [
                    {
                        "id": 2376,
                        "name": "西安市"
                    },
                    {
                        "id": 2386,
                        "name": "铜川市"
                    },
                    {
                        "id": 2390,
                        "name": "宝鸡市"
                    },
                    {
                        "id": 2402,
                        "name": "咸阳市"
                    },
                    {
                        "id": 2416,
                        "name": "渭南市"
                    },
                    {
                        "id": 2428,
                        "name": "延安市"
                    },
                    {
                        "id": 2442,
                        "name": "汉中市"
                    },
                    {
                        "id": 2454,
                        "name": "榆林市"
                    },
                    {
                        "id": 2468,
                        "name": "商洛市"
                    },
                    {
                        "id": 2476,
                        "name": "安康市"
                    }
                ],
                "28": [
                    {
                        "id": 2487,
                        "name": "兰州市"
                    },
                    {
                        "id": 2492,
                        "name": "金昌市"
                    },
                    {
                        "id": 2495,
                        "name": "白银市"
                    },
                    {
                        "id": 2501,
                        "name": "天水市"
                    },
                    {
                        "id": 2509,
                        "name": "嘉峪关市"
                    },
                    {
                        "id": 2518,
                        "name": "平凉市"
                    },
                    {
                        "id": 2525,
                        "name": "庆阳市"
                    },
                    {
                        "id": 2534,
                        "name": "陇南市"
                    },
                    {
                        "id": 2544,
                        "name": "武威市"
                    },
                    {
                        "id": 2549,
                        "name": "张掖市"
                    },
                    {
                        "id": 2556,
                        "name": "酒泉市"
                    },
                    {
                        "id": 2564,
                        "name": "甘南州"
                    },
                    {
                        "id": 2573,
                        "name": "临夏州"
                    },
                    {
                        "id": 3080,
                        "name": "定西市"
                    }
                ],
                "29": [
                    {
                        "id": 2580,
                        "name": "西宁市"
                    },
                    {
                        "id": 2585,
                        "name": "海东地区"
                    },
                    {
                        "id": 2592,
                        "name": "海北州"
                    },
                    {
                        "id": 2597,
                        "name": "黄南州"
                    },
                    {
                        "id": 2603,
                        "name": "海南州"
                    },
                    {
                        "id": 2605,
                        "name": "果洛州"
                    },
                    {
                        "id": 2612,
                        "name": "玉树州"
                    },
                    {
                        "id": 2620,
                        "name": "海西州"
                    }
                ],
                "30": [
                    {
                        "id": 2628,
                        "name": "银川市"
                    },
                    {
                        "id": 2632,
                        "name": "石嘴山市"
                    },
                    {
                        "id": 2637,
                        "name": "吴忠市"
                    },
                    {
                        "id": 2644,
                        "name": "固原市"
                    },
                    {
                        "id": 3071,
                        "name": "中卫市"
                    }
                ],
                "31": [
                    {
                        "id": 2652,
                        "name": "乌鲁木齐市"
                    },
                    {
                        "id": 2654,
                        "name": "克拉玛依市"
                    },
                    {
                        "id": 2656,
                        "name": "石河子市"
                    },
                    {
                        "id": 2658,
                        "name": "吐鲁番地区"
                    },
                    {
                        "id": 2662,
                        "name": "哈密地区"
                    },
                    {
                        "id": 2666,
                        "name": "和田地区"
                    },
                    {
                        "id": 2675,
                        "name": "阿克苏地区"
                    },
                    {
                        "id": 2686,
                        "name": "喀什地区"
                    },
                    {
                        "id": 2699,
                        "name": "克孜勒苏柯尔克孜自治州"
                    },
                    {
                        "id": 2704,
                        "name": "巴音郭楞州"
                    },
                    {
                        "id": 2714,
                        "name": "昌吉州"
                    },
                    {
                        "id": 2723,
                        "name": "博尔塔拉州"
                    },
                    {
                        "id": 2727,
                        "name": "伊犁州"
                    },
                    {
                        "id": 2736,
                        "name": "塔城地区"
                    },
                    {
                        "id": 2744,
                        "name": "阿勒泰地区"
                    },
                    {
                        "id": 4110,
                        "name": "五家渠市"
                    },
                    {
                        "id": 15945,
                        "name": "阿拉尔市"
                    },
                    {
                        "id": 15946,
                        "name": "图木舒克市"
                    },
                    {
                        "id": 53090,
                        "name": "铁门关市"
                    },
                    {
                        "id": 53668,
                        "name": "昆玉市"
                    }
                ],
                "32": [
                    {
                        "id": 2768,
                        "name": "台湾"
                    }
                ],
                "84": [
                    {
                        "id": 1310,
                        "name": "钓鱼岛"
                    }
                ],
                "52993": [
                    {
                        "id": 52994,
                        "name": "香港特别行政区"
                    },
                    {
                        "id": 52995,
                        "name": "澳门特别行政区"
                    }
                ],
                '53283': {
                    'A': [
                        {
                            id: 53285, name: '阿尔巴尼亚'
                        },
                        {
                            id: 53296, name: '阿尔及利亚'
                        },
                        {
                            id: 53284, name: '阿富汗'
                        },
                        {
                            id: 53297, name: '阿根廷'
                        },
                        {
                            id: 53300, name: '阿联酋'
                        },
                        {
                            id: 53302, name: '阿鲁巴'
                        },
                        {
                            id: 53495, name: '阿曼'
                        },
                        {
                            id: 53315, name: '阿塞拜疆'
                        },
                        {
                            id: 53320, name: '埃及'
                        },
                        {
                            id: 53336, name: '埃塞俄比亚'
                        },
                        {
                            id: 53337, name: '爱尔兰'
                        },
                        {
                            id: 53338, name: '爱沙尼亚'
                        },
                        {
                            id: 53339, name: '安道尔'
                        },
                        {
                            id: 53341, name: '安哥拉'
                        },
                        {
                            id: 53343, name: '安圭拉'
                        },
                        {
                            id: 53346, name: '奥地利'
                        },
                        {
                            id: 53347, name: '澳大利亚'
                        },
                        {
                            id: 53344, name: '安提瓜和巴布达'
                        }
                    ],
                    'B': [
                        {
                            id: 53349, name: '巴巴多斯'
                        },
                        {
                            id: 53352, name: '巴哈马'
                        },
                        {
                            id: 53353, name: '巴基斯坦'
                        },
                        {
                            id: 53354, name: '巴拉圭'
                        },
                        {
                            id: 53355, name: '巴林'
                        },
                        {
                            id: 53356, name: '巴拿马'
                        },
                        {
                            id: 53357, name: '巴西'
                        },
                        {
                            id: 53359, name: '白俄罗斯'
                        },
                        {
                            id: 53361, name: '百慕大三角'
                        },
                        {
                            id: 53362, name: '保加利亚'
                        },
                        {
                            id: 53365, name: '贝宁'
                        },
                        {
                            id: 53367, name: '比利时'
                        },
                        {
                            id: 53368, name: '冰岛'
                        },
                        {
                            id: 53370, name: '波多黎各'
                        },
                        {
                            id: 53372, name: '波兰'
                        },
                        {
                            id: 53375, name: '玻利维亚'
                        },
                        {
                            id: 53377, name: '伯利兹'
                        },
                        {
                            id: 53379, name: '博茨瓦纳'
                        },
                        {
                            id: 53380, name: '不丹'
                        },
                        {
                            id: 53384, name: '布隆迪'
                        },
                        {
                            id: 53382, name: '布基纳法索'
                        },
                        {
                            id: 53350, name: '巴布亚新几内亚'
                        },
                        {
                            id: 53374, name: '波斯尼亚和黑塞哥维那'
                        }
                    ],
                    'CDEF': [
                        {
                            id: 53387, name: '丹麦'
                        },
                        {
                            id: 53389, name: '德国'
                        },
                        {
                            id: 53391, name: '东帝汶'
                        },
                        {
                            id: 53392, name: '多哥'
                        },
                        {
                            id: 53395, name: '俄罗斯'
                        },
                        {
                            id: 53396, name: '厄瓜多尔'
                        },
                        {
                            id: 53398, name: '法国'
                        },
                        {
                            id: 53399, name: '法罗群岛'
                        },
                        {
                            id: 53401, name: '菲律宾'
                        },
                        {
                            id: 53403, name: '斐济群岛'
                        },
                        {
                            id: 53405, name: '芬兰'
                        },
                        {
                            id: 53406, name: '佛得角'
                        },
                        {
                            id: 53400, name: '法属圭亚那'
                        },
                        {
                            id: 53397, name: '厄立特里亚'
                        },
                        {
                            id: 53386, name: '赤道几内亚'
                        },
                        {
                            id: 53394, name: '多米尼加共和国'
                        }
                    ],
                    'GH': [
                        {
                            id: 53407, name: '冈比亚'
                        },
                        {
                            id: 53408, name: '刚果'
                        },
                        {
                            id: 53409, name: '哥伦比亚'
                        },
                        {
                            id: 53410, name: '哥斯达黎加'
                        },
                        {
                            id: 53411, name: '格林纳达'
                        },
                        {
                            id: 53412, name: '格陵兰'
                        },
                        {
                            id: 53413, name: '格鲁吉亚'
                        },
                        {
                            id: 53414, name: '古巴'
                        },
                        {
                            id: 53415, name: '瓜德罗普'
                        },
                        {
                            id: 53417, name: '关岛'
                        },
                        {
                            id: 53419, name: '圭亚那'
                        },
                        {
                            id: 53420, name: '哈萨克斯坦'
                        },
                        {
                            id: 53421, name: '海地'
                        },
                        {
                            id: 53422, name: '韩国'
                        },
                        {
                            id: 53423, name: '荷兰'
                        },
                        {
                            id: 53425, name: '黑山'
                        },
                        {
                            id: 53426, name: '洪都拉斯'
                        }
                    ],
                    'JK': [
                        {
                            id: 53430, name: '吉布提'
                        },
                        {
                            id: 53434, name: '几内亚'
                        },
                        {
                            id: 53436, name: '几内亚比绍'
                        },
                        {
                            id: 53440, name: '加拿大'
                        },
                        {
                            id: 53442, name: '加纳'
                        },
                        {
                            id: 53444, name: '加蓬'
                        },
                        {
                            id: 53445, name: '柬埔寨'
                        },
                        {
                            id: 53447, name: '捷克'
                        },
                        {
                            id: 53449, name: '津巴布韦'
                        },
                        {
                            id: 53451, name: '喀麦隆'
                        },
                        {
                            id: 53453, name: '卡塔尔'
                        },
                        {
                            id: 53455, name: '开曼群岛'
                        },
                        {
                            id: 53457, name: '科摩罗'
                        },
                        {
                            id: 53458, name: '科特迪瓦'
                        },
                        {
                            id: 53460, name: '科威特'
                        },
                        {
                            id: 53461, name: '克罗地亚'
                        },
                        {
                            id: 53463, name: '肯尼亚'
                        },
                        {
                            id: 53464, name: '库克群岛'
                        },
                        {
                            id: 53432, name: '吉尔吉斯斯坦'
                        }
                    ],
                    'L': [
                        {
                            id: 53466, name: '拉脱维亚'
                        },
                        {
                            id: 53467, name: '莱索托'
                        },
                        {
                            id: 53476, name: '老挝'
                        },
                        {
                            id: 53479, name: '黎巴嫩'
                        },
                        {
                            id: 53481, name: '立陶宛'
                        },
                        {
                            id: 53482, name: '利比里亚'
                        },
                        {
                            id: 53484, name: '利比亚'
                        },
                        {
                            id: 53486, name: '列支敦士登'
                        },
                        {
                            id: 53491, name: '卢森堡'
                        },
                        {
                            id: 53493, name: '卢旺达'
                        },
                        {
                            id: 53494, name: '罗马尼亚'
                        }
                    ],
                    'M': [
                        {
                            id: 53298, name: '马尔代夫'
                        },
                        {
                            id: 53299, name: '马耳他'
                        },
                        {
                            id: 53301, name: '马拉维'
                        },
                        {
                            id: 53303, name: '马来西亚'
                        },
                        {
                            id: 53304, name: '马里'
                        },
                        {
                            id: 53305, name: '马其顿'
                        },
                        {
                            id: 5***REMOVED***, name: '马提尼克'
                        },
                        {
                            id: 53307, name: '毛里求斯'
                        },
                        {
                            id: 53308, name: '毛里塔尼亚'
                        },
                        {
                            id: 53309, name: '美国'
                        },
                        {
                            id: 53286, name: '美属萨摩亚'
                        },
                        {
                            id: 53311, name: '蒙古'
                        },
                        {
                            id: 53312, name: '蒙特塞拉特'
                        },
                        {
                            id: 53313, name: '孟加拉'
                        },
                        {
                            id: 53314, name: '秘鲁'
                        },
                        {
                            id: 53317, name: '摩尔多瓦'
                        },
                        {
                            id: 53318, name: '摩洛哥'
                        },
                        {
                            id: 53319, name: '摩纳哥'
                        },
                        {
                            id: 53321, name: '莫桑比克'
                        },
                        {
                            id: 53322, name: '墨西哥'
                        },
                        {
                            id: 53316, name: '密克罗尼西亚'
                        },
                        {
                            id: 53310, name: '美属维尔京群岛'
                        },
                        {
                            id: 53496, name: '马达加斯加'
                        }
                    ],
                    'NPR': [
                        {
                            id: 53323, name: '纳米比亚'
                        },
                        {
                            id: 53324, name: '南非'
                        },
                        {
                            id: 53325, name: '南苏丹'
                        },
                        {
                            id: 53326, name: '尼泊尔'
                        },
                        {
                            id: 53327, name: '尼加拉瓜'
                        },
                        {
                            id: 53328, name: '尼日尔'
                        },
                        {
                            id: 53329, name: '尼日利亚'
                        },
                        {
                            id: 53330, name: '挪威'
                        },
                        {
                            id: 53331, name: '帕劳'
                        },
                        {
                            id: 53332, name: '葡萄牙'
                        },
                        {
                            id: 53333, name: '日本'
                        },
                        {
                            id: 53334, name: '瑞典'
                        },
                        {
                            id: 53335, name: '瑞士'
                        }
                    ],
                    'S': [
                        {
                            id: 53340, name: '萨尔瓦多'
                        },
                        {
                            id: 53342, name: '萨摩亚'
                        },
                        {
                            id: 53345, name: '塞尔维亚'
                        },
                        {
                            id: 53348, name: '塞拉利昂'
                        },
                        {
                            id: 53351, name: '塞内加尔'
                        },
                        {
                            id: 53358, name: '塞浦路斯'
                        },
                        {
                            id: 53360, name: '塞舌尔'
                        },
                        {
                            id: 53363, name: '沙特阿拉伯'
                        },
                        {
                            id: 53369, name: '圣卢西亚'
                        },
                        {
                            id: 53371, name: '圣马力诺'
                        },
                        {
                            id: 53376, name: '斯里兰卡'
                        },
                        {
                            id: 53378, name: '斯洛伐克'
                        },
                        {
                            id: 53381, name: '斯洛文尼亚'
                        },
                        {
                            id: 53383, name: '斯威士兰'
                        },
                        {
                            id: 53385, name: '苏丹'
                        },
                        {
                            id: 53388, name: '苏里南'
                        },
                        {
                            id: 53393, name: '索马里'
                        },
                        {
                            id: 53390, name: '所罗门群岛'
                        },
                        {
                            id: 53366, name: '圣基茨和尼维斯'
                        },
                        {
                            id: 53364, name: '圣多美和普林西比'
                        },
                        {
                            id: 53373, name: '圣文森特和格林纳丁斯'
                        }
                    ],
                    'TW': [
                        {
                            id: 53402, name: '塔吉克斯坦'
                        },
                        {
                            id: 53404, name: '泰国'
                        },
                        {
                            id: 53418, name: '坦桑尼亚'
                        },
                        {
                            id: 53424, name: '汤加'
                        },
                        {
                            id: 53431, name: '突尼斯'
                        },
                        {
                            id: 53433, name: '图瓦卢'
                        },
                        {
                            id: 53435, name: '土耳其'
                        },
                        {
                            id: 53437, name: '瓦努阿图'
                        },
                        {
                            id: 53438, name: '危地马拉'
                        },
                        {
                            id: 53439, name: '委内瑞拉'
                        },
                        {
                            id: 53441, name: '文莱'
                        },
                        {
                            id: 53443, name: '乌干达'
                        },
                        {
                            id: 53446, name: '乌克兰'
                        },
                        {
                            id: 53448, name: '乌拉圭'
                        },
                        {
                            id: 53450, name: '乌兹别克斯坦'
                        },
                        {
                            id: 53429, name: '特立尼达和多巴哥'
                        },
                        {
                            id: 53427, name: '特克斯和凯科斯群岛'
                        }
                    ],
                    'XYZ': [
                        {
                            id: 53452, name: '西班牙'
                        },
                        {
                            id: 53454, name: '希腊'
                        },
                        {
                            id: 53456, name: '新加坡'
                        },
                        {
                            id: 53462, name: '新西兰'
                        },
                        {
                            id: 53465, name: '匈牙利'
                        },
                        {
                            id: 53468, name: '叙利亚'
                        },
                        {
                            id: 53469, name: '牙买加'
                        },
                        {
                            id: 53470, name: '亚美尼亚'
                        },
                        {
                            id: 53471, name: '也门'
                        },
                        {
                            id: 53472, name: '伊拉克'
                        },
                        {
                            id: 53473, name: '伊朗'
                        },
                        {
                            id: 53474, name: '以色列'
                        },
                        {
                            id: 53475, name: '意大利'
                        },
                        {
                            id: 53477, name: '印度'
                        },
                        {
                            id: 53478, name: '印度尼西亚'
                        },
                        {
                            id: 53480, name: '英国'
                        },
                        {
                            id: 53485, name: '约旦'
                        },
                        {
                            id: 53487, name: '越南'
                        },
                        {
                            id: 53488, name: '赞比亚'
                        },
                        {
                            id: 53489, name: '乍得'
                        },
                        {
                            id: 53490, name: '智利'
                        },
                        {
                            id: 53492, name: '中非'
                        },
                        {
                            id: 53459, name: '新喀里多尼亚'
                        },
                        {
                            id: 53483, name: '英属维尔京群岛'
                        }
                    ]
                }
            },
            '1': {},
            '2': {},
            '3': {}
        },
        provinceMap: {
            '1': '北京',
            '2': '上海',
            '3': '天津',
            '4': '重庆',
            '5': '河北',
            '6': '山西',
            '7': '河南',
            '8': '辽宁',
            '9': '吉林',
            '10': '黑龙江',
            '11': '内蒙古',
            '12': '江苏',
            '13': '山东',
            '14': '安徽',
            '15': '浙江',
            '16': '福建',
            '17': '湖北',
            '18': '湖南',
            '19': '广东',
            '20': '广西',
            '21': '江西',
            '22': '四川',
            '23': '海南',
            '24': '贵州',
            '25': '云南',
            '26': '西藏',
            '27': '陕西',
            '28': '甘肃',
            '29': '青海',
            '30': '宁夏',
            '31': '新疆',
            '32': '台湾',
            '52993': '港澳',
            '84': '钓鱼岛',
            '53283': '海外'
        },
        provinceHtml: '\
            <li data-value="1"  data-name="北京"><a href="#none">北京</a></li>\
            <li data-value="2"  data-name="上海"><a href="#none">上海</a></li>\
            <li data-value="3"  data-name="天津"><a href="#none">天津</a></li>\
            <li data-value="4"  data-name="重庆"><a href="#none">重庆</a></li>\
            <li data-value="5"  data-name="河北"><a href="#none">河北</a></li>\
            <li data-value="6"  data-name="山西"><a href="#none">山西</a></li>\
            <li data-value="7"  data-name="河南"><a href="#none">河南</a></li>\
            <li data-value="8"  data-name="辽宁"><a href="#none">辽宁</a></li>\
            <li data-value="9"  data-name="吉林"><a href="#none">吉林</a></li>\
            <li data-value="10" data-name="黑龙江"><a href="#none">黑龙江</a></li>\
            <li data-value="11" data-name="内蒙古"><a href="#none">内蒙古</a></li>\
            <li data-value="12" data-name="江苏"><a href="#none">江苏</a></li>\
            <li data-value="13" data-name="山东"><a href="#none">山东</a></li>\
            <li data-value="14" data-name="安徽"><a href="#none">安徽</a></li>\
            <li data-value="15" data-name="浙江"><a href="#none">浙江</a></li>\
            <li data-value="16" data-name="福建"><a href="#none">福建</a></li>\
            <li data-value="17" data-name="湖北"><a href="#none">湖北</a></li>\
            <li data-value="18" data-name="湖南"><a href="#none">湖南</a></li>\
            <li data-value="19" data-name="广东"><a href="#none">广东</a></li>\
            <li data-value="20" data-name="广西"><a href="#none">广西</a></li>\
            <li data-value="21" data-name="江西"><a href="#none">江西</a></li>\
            <li data-value="22" data-name="四川"><a href="#none">四川</a></li>\
            <li data-value="23" data-name="海南"><a href="#none">海南</a></li>\
            <li data-value="24" data-name="贵州"><a href="#none">贵州</a></li>\
            <li data-value="25" data-name="云南"><a href="#none">云南</a></li>\
            <li data-value="26" data-name="西藏"><a href="#none">西藏</a></li>\
            <li data-value="27" data-name="陕西"><a href="#none">陕西</a></li>\
            <li data-value="28" data-name="甘肃"><a href="#none">甘肃</a></li>\
            <li data-value="29" data-name="青海"><a href="#none">青海</a></li>\
            <li data-value="30" data-name="宁夏"><a href="#none">宁夏</a></li>\
            <li data-value="31" data-name="新疆"><a href="#none">新疆</a></li>\
            <li data-value="32" data-name="台湾"><a href="#none">台湾</a></li>\
            <li data-value="52993" data-name="港澳"><a href="#none">港澳</a></li>\
            <li data-value="84" data-name="钓鱼岛"><a href="#none">钓鱼岛</a></li>\
            <li data-value="53283" data-name="海外"><a href="#none">海外</a></li>',
        province: {
            北京: {
                id: '1', root: 0, djd: 1, c: 72
            },
            上海: {
                id: '2', root: 1, djd: 1, c: 78
            },
            天津: {
                id: '3', root: 0, djd: 1, c: 51035
            },
            重庆: {
                id: '4', root: 3, djd: 1, c: 113
            },
            河北: {
                id: '5', root: 0, djd: 1, c: 142
            },
            山西: {
                id: '6', root: 0, djd: 1, c: 303
            },
            河南: {
                id: '7', root: 0, djd: 1, c: 412
            },
            辽宁: {
                id: '8', root: 0, djd: 1, c: 560
            },
            吉林: {
                id: '9', root: 0, djd: 1, c: 639
            },
            黑龙江: {
                id: '10', root: 0, djd: 1, c: 698
            },
            内蒙古: {
                id: '11', root: 0, djd: 0, c: 799
            },
            江苏: {
                id: '12', root: 1, djd: 1, c: 904
            },
            山东: {
                id: '13', root: 0, djd: 1, c: 1000
            },
            安徽: {
                id: '14', root: 1, djd: 1, c: 1116
            },
            浙江: {
                id: '15', root: 1, djd: 1, c: 1158
            },
            福建: {
                id: '16', root: 2, djd: 1, c: 1303
            },
            湖北: {
                id: '17', root: 0, djd: 1, c: 1381
            },
            湖南: {
                id: '18', root: 2, djd: 1, c: 1482
            },
            广东: {
                id: '19', root: 2, djd: 1, c: 1601
            },
            广西: {
                id: '20', root: 2, djd: 1, c: 1715
            },
            江西: {
                id: '21', root: 2, djd: 1, c: 1827
            },
            四川: {
                id: '22', root: 3, djd: 1, c: 1930
            },
            海南: {
                id: '23', root: 2, djd: 1, c: 2121
            },
            贵州: {
                id: '24', root: 3, djd: 1, c: 2144
            },
            云南: {
                id: '25', root: 3, djd: 1, c: 2235
            },
            西藏: {
                id: '26', root: 3, djd: 0, c: 2951
            },
            陕西: {
                id: '27', root: 3, djd: 1, c: 2376
            },
            甘肃: {
                id: '28', root: 3, djd: 1, c: 2487
            },
            青海: {
                id: '29', root: 3, djd: 0, c: 2580
            },
            宁夏: {
                id: '30', root: 3, djd: 1, c: 2628
            },
            新疆: {
                id: '31', root: 3, djd: 0, c: 2652
            },
            台湾: {
                id: '32', root: 2, djd: 0, c: 2768
            },
            港澳: {
                id: '52993', root: 2, djd: 0, c: 2754
            },
            钓鱼岛: {
                id: '84', root: 2, djd: 0, c: 84
            }
        },
        // 取三级地址失败的时候默认选择地区值
        area: {
            '2802': '2821',
            '72': '2799',
            '2801': '2827',
            '2804': '2828',
            '2800': '2848',
            '2803': '2829',
            '2805': '2832',
            '2807': '51552',
            '2809': '51216',
            '2806': '2831',
            '2953': '2954',
            '2816': '2862',
            '2810': '4194',
            '2814': '2847',
            '3065': '51505',
            '2901': '2906',
            '2817': '2873',
            '2813': '2863',
            '2815': '2870',
            '2820': '2879',
            '2822': '2856',
            '2823': '2884',
            '2824': '51911',
            '2825': '2892',
            '2833': '2869',
            '2826': '2864',
            '2834': '2866',
            '2835': '2868',
            '2837': '2888',
            '2841': '2876',
            '2919': '50779',
            '51036': '2984',
            '78': '79',
            '51037': '2987',
            '51038': '3000',
            '51035': '39620',
            '51039': '2985',
            '51041': '98',
            '51042': '36157',
            '51044': '25708',
            '51040': '2986',
            '51043': '2907',
            '51045': '25711',
            '51046': '22846',
            '51051': '22848',
            '51048': '23672',
            '51047': '25704',
            '51049': '8545',
            '51052': '23674',
            '51050': '6646',
            '123': '9754',
            '48132': '48163',
            '48203': '48237',
            '48206': '48277',
            '50950': '88',
            '50951': '4298',
            '48131': '48185',
            '50953': '50979',
            '50952': '106',
            '50954': '111',
            '51026': '103',
            '51027': '50956',
            '51028': '50955',
            '142': '143',
            '148': '167',
            '224': '225',
            '164': '183',
            '258': '2756',
            '239': '241',
            '274': '284',
            '248': '261',
            '275': '291',
            '264': '265',
            '2808': '51528',
            '309': '310',
            '318': '319',
            '303': '304',
            '330': '331',
            '2812': '51125',
            '336': '338',
            '325': '326',
            '350': '351',
            '368': '369',
            '379': '380',
            '398': '399',
            '412': '415',
            '3074': '3075',
            '438': '439',
            '427': '428',
            '420': '421',
            '454': '455',
            '468': '469',
            '446': '447',
            '458': '459',
            '475': '476',
            '482': '483',
            '489': '490',
            '495': '496',
            '502': '503',
            '517': '518',
            '538': '540',
            '549': '551',
            '2780': '35173',
            '560': '567',
            '573': '574',
            '527': '529',
            '2830': '51800',
            '579': '580',
            '584': '585',
            '589': '591',
            '593': '596',
            '604': '606',
            '598': '599',
            '609': '610',
            '632': '633',
            '617': '618',
            '621': '623',
            '613': '614',
            '639': '640',
            '6858': '6859',
            '2992': '2993',
            '644': '645',
            '651': '652',
            '657': '658',
            '674': '675',
            '664': '665',
            '681': '682',
            '687': '3312',
            '727': '728',
            '731': '733',
            '742': '744',
            '737': '739',
            '753': '754',
            '773': '774',
            '765': '766',
            '757': '758',
            '793': '794',
            '776': '777',
            '698': '699',
            '782': '784',
            '712': '713',
            '805': '807',
            '799': '801',
            '810': '811',
            '835': '836',
            '812': '814',
            '823': '824',
            '870': '871',
            '848': '849',
            '891': '892',
            '880': '881',
            '895': '896',
            '902': '3142',
            '925': '926',
            '911': '914',
            '919': '920',
            '904': '905',
            '933': '934',
            '951': '955',
            '113': '9775',
            '965': '967',
            '978': '980',
            '114': '9893',
            '939': '940',
            '972': '973',
            '959': '960',
            '115': '9938',
            '119': '9970',
            '988': '993',
            '984': '3381',
            '2900': '2908',
            '126': '13518',
            '1016': '1019',
            '1000': '1002',
            '131': '10377',
            '128': '10002',
            '1007': '1014',
            '1025': '1026',
            '1022': '3522',
            '1032': '1033',
            '129': '10032',
            '1042': '1044',
            '1053': '1054',
            '1060': '1061',
            '133': '10089',
            '132': '9827',
            '1081': '1082',
            '1058': '1059',
            '1072': '1073',
            '1090': '1092',
            '130': '10058',
            '1151': '1153',
            '1167': '1168',
            '134': '10131',
            '1099': '1101',
            '1112': '3132',
            '1108': '2934',
            '135': '10158',
            '136': '10187',
            '1174': '1176',
            '1180': '1181',
            '1159': '1161',
            '139': '10283',
            '1206': '1207',
            '1201': '1202',
            '2971': '2972',
            '137': '10213',
            '138': '10244',
            '140': '10307',
            '1121': '1122',
            '1116': '1119',
            '1114': '19783',
            '1127': '1128',
            '1124': '19223',
            '1132': '1133',
            '141': '10346',
            '1137': '1138',
            '1140': '1141',
            '1290': '1291',
            '48133': '48134',
            '48201': '48295',
            '48202': '48351',
            '1158': '1224',
            '1280': '1281',
            '1273': '1275',
            '48204': '48209',
            '1213': '1214',
            '48205': '48325',
            '1233': '1237',
            '1298': '1300',
            '1250': '1251',
            '1255': '1257',
            '48207': '48254',
            '1243': '1244',
            '1303': '1305',
            '1317': '1319',
            '1262': '1263',
            '1332': '1334',
            '1329': '1331',
            '1315': '1316',
            '1352': '1354',
            '1341': '1343',
            '1362': '1364',
            '1370': '1372',
            '1432': '1435',
            '1441': '1444',
            '1458': '1461',
            '50995': '50996',
            '1466': '1467',
            '1475': '3601',
            '3154': '23610',
            '1479': '3163',
            '1477': '1478',
            '1387': '1389',
            '1381': '1386',
            '4164': '10406',
            '1413': '1414',
            '1405': '1406',
            '1421': '1423',
            '1396': '1397',
            '199': '203',
            '1488': '1489',
            '1495': '1496',
            '1482': '1485',
            '1501': '1502',
            '1522': '1523',
            '1540': '1541',
            '1499': '1500',
            '1511': '1512',
            '1530': '1532',
            '1544': '1545',
            '1555': '1556',
            '1560': '1563',
            '1574': '1575',
            '1586': '1588',
            '1592': '1593',
            '1601': '3633',
            '1607': '3155',
            '1617': '1618',
            '1609': '41653',
            '1627': '1628',
            '1611': '1614',
            '1634': '1635',
            '1709': '1712',
            '1650': '1653',
            '1643': '1647',
            '1659': '37258',
            '1684': '1687',
            '1666': '1669',
            '1672': '1673',
            '1677': '1679',
            '1698': '1700',
            '1690': '1693',
            '1704': '1795',
            '3168': '3169',
            '1715': '1716',
            '1705': '1707',
            '1726': '1727',
            '1720': '1721',
            '1740': '1741',
            '1757': '1758',
            '1746': '1747',
            '1749': '1750',
            '1761': '1762',
            '1792': '1803',
            '1753': '1754',
            '3044': '3046',
            '1806': '1807',
            '1818': '1820',
            '1832': '1833',
            '1827': '1828',
            '1836': '1837',
            '1842': '1843',
            '1857': '1858',
            '1874': '1875',
            '1845': '1846',
            '1861': '1863',
            '1885': '1887',
            '1930': '4284',
            '1911': '1912',
            '1898': '1899',
            '2103': '2105',
            '1946': '1947',
            '1954': '1955',
            '1960': '1970',
            '1950': '1951',
            '1977': '1978',
            '1962': '1965',
            '1983': '1984',
            '1988': '1989',
            '2005': '2006',
            '2022': '2028',
            '2033': '2034',
            '1993': '1994',
            '2016': '2017',
            '2047': '2049',
            '2042': '2044',
            '2070': '2071',
            '2065': '2068',
            '2084': '2085',
            '2058': '2060',
            '3690': '3693',
            '3699': '3712',
            '3701': '3790',
            '3703': '3811',
            '3706': '3834',
            '3702': '3801',
            '3707': '3878',
            '3705': '3828',
            '3704': '3820',
            '3709': '3869',
            '3708': '3858',
            '3710': '3845',
            '3711': '3887',
            '3115': '3720',
            '3137': '3768',
            '2121': '22466',
            '3173': '3780',
            '2150': '2151',
            '2155': '2156',
            '2144': '2145',
            '2169': '2170',
            '2189': '2190',
            '2196': '2197',
            '2205': '2206',
            '2180': '2182',
            '4108': '6823',
            '2222': '2223',
            '2235': '2236',
            '2258': '2259',
            '2247': '2249',
            '2270': '2271',
            '2281': '2282',
            '2291': '2292',
            '2304': '2305',
            '2309': '2310',
            '2318': '2319',
            '2298': '2299',
            '2336': '2338',
            '2332': '2333',
            '2366': '2367',
            '2347': '2349',
            '2360': '2361',
            '3970': '3972',
            '3971': '3979',
            '2951': '2952',
            '3138': '3139',
            '3107': '3108',
            '3129': '3130',
            '3144': '3160',
            '2442': '2443',
            '2428': '2429',
            '2454': '2456',
            '2386': '2387',
            '2468': '2469',
            '2476': '2478',
            '2376': '2380',
            '2390': '2392',
            '2402': '2403',
            '2525': '2526',
            '2416': '2417',
            '2534': '2535',
            '2549': '2550',
            '2544': '2545',
            '2564': '2565',
            '2573': '2574',
            '3080': '3081',
            '2556': '2558',
            '2487': '2488',
            '2492': '2493',
            '2501': '2504',
            '2518': '2519',
            '2509': '2970',
            '2580': '2581',
            '2495': '2496',
            '2585': '2586',
            '2603': '4012',
            '2592': '2593',
            '2597': '2598',
            '2605': '2606',
            '2620': '2621',
            '2612': '2613',
            '2628': '2629',
            '2632': '2633',
            '4110': '4122',
            '3071': '3072',
            '2644': '2647',
            '2637': '2638',
            '15945': '15948',
            '2654': '2655',
            '2656': '2657',
            '15946': '15947',
            '2652': '2653',
            '2662': '2663',
            '2658': '2659',
            '2666': '2667',
            '2675': '2676',
            '2699': '2700',
            '2686': '2687',
            '2727': '2728',
            '2714': '2715',
            '2704': '2705',
            '2736': '2737',
            '2723': '2724',
            '2744': '2745',
            '2754': '2755',
            '2768': '2769',
            '2770': '2771',
            '2922': '23585',
            '2980': '23618',
            '2983': '23646',
            '1655': '2950',
            '1657': '2777',
            '3698': '3752',
            '3034': '3125'
        }
    };
    return common_areaMap;
};
/* area.js for item.default,item.worldbuy end */
/* city.js for item.default begin */
function common_getCityMap() {
    var common_cityMap = {
        '朝阳区': '1|72',
        '海淀区': '1|2800',
        '西城区': '1|2801',
        '东城区': '1|2802',
        '崇文区': '1|2803',
        '宣武区': '1|2804',
        '丰台区': '1|2805',
        '石景山区': '1|2806',
        '门头沟': '1|2807',
        '房山区': '1|2808',
        '通州区': '1|2809',
        '大兴区': '1|2810',
        '顺义区': '1|2812',
        '怀柔区': '1|2814',
        '密云区': '1|2816',
        '昌平区': '1|2901',
        '平谷区': '1|2953',
        '延庆县': '1|3065',
        '徐汇区': '2|2813',
        '长宁区': '2|2815',
        '静安区': '2|2817',
        '闸北区': '2|2820',
        '虹口区': '2|2822',
        '杨浦区': '2|2823',
        '宝山区': '2|2824',
        '闵行区': '2|2825',
        '嘉定区': '2|2826',
        '浦东新区': '2|2830',
        '青浦区': '2|2833',
        '松江区': '2|2834',
        '金山区': '2|2835',
        '奉贤区': '2|2837',
        '普陀区': '2|2841',
        '崇明县': '2|2919',
        '黄浦区': '2|78',
        '东丽区': '3|51035',
        '和平区': '3|51036',
        '河北区': '3|51037',
        '河东区': '3|51038',
        '河西区': '3|51039',
        '红桥区': '3|51040',
        '蓟县': '3|51041',
        '静海县': '3|51042',
        '南开区': '3|51043',
        '塘沽区': '3|51044',
        '西青区': '3|51045',
        '武清区': '3|51046',
        '津南区': '3|51047',
        '汉沽区': '3|51048',
        '大港区': '3|51049',
        '北辰区': '3|51050',
        '宝坻区': '3|51051',
        '宁河县': '3|51052',
        '万州区': '4|113',
        '涪陵区': '4|114',
        '梁平区': '4|115',
        '南川区': '4|119',
        '潼南区': '4|123',
        '大足区': '4|126',
        '黔江区': '4|128',
        '武隆区': '4|129',
        '丰都县': '4|130',
        '奉节县': '4|131',
        '开州区': '4|132',
        '云阳县': '4|133',
        '忠县': '4|134',
        '巫溪县': '4|135',
        '巫山县': '4|136',
        '石柱县': '4|137',
        '彭水县': '4|138',
        '垫江县': '4|139',
        '酉阳县': '4|140',
        '秀山县': '4|141',
        '璧山区': '4|48131',
        '荣昌区': '4|48132',
        '铜梁区': '4|48133',
        '合川区': '4|48201',
        '巴南区': '4|48202',
        '北碚区': '4|48203',
        '江津区': '4|48204',
        '渝北区': '4|48205',
        '长寿区': '4|48206',
        '永川区': '4|48207',
        '江北区': '4|50950',
        '南岸区': '4|50951',
        '九龙坡区': '4|50952',
        '沙坪坝区': '4|50953',
        '大渡口区': '4|50954',
        '綦江区': '4|50995',
        '渝中区': '4|51026',
        '高新区': '4|51027',
        '北部新区': '4|51028',
        '城口县': '4|4164',
        '石家庄市': '5|142',
        '邯郸市': '5|148',
        '邢台市': '5|164',
        '保定市': '5|199',
        '张家口市': '5|224',
        '承德市': '5|239',
        '秦皇岛市': '5|248',
        '唐山市': '5|258',
        '沧州市': '5|264',
        '廊坊市': '5|274',
        '衡水市': '5|275',
        '太原市': '6|303',
        '大同市': '6|309',
        '阳泉市': '6|318',
        '晋城市': '6|325',
        '朔州市': '6|330',
        '晋中市': '6|336',
        '忻州市': '6|350',
        '吕梁市': '6|368',
        '临汾市': '6|379',
        '运城市': '6|398',
        '长治市': '6|3074',
        '郑州市': '7|412',
        '开封市': '7|420',
        '洛阳市': '7|427',
        '平顶山市': '7|438',
        '焦作市': '7|446',
        '鹤壁市': '7|454',
        '新乡市': '7|458',
        '安阳市': '7|468',
        '濮阳市': '7|475',
        '许昌市': '7|482',
        '漯河市': '7|489',
        '三门峡市': '7|495',
        '南阳市': '7|502',
        '商丘市': '7|517',
        '周口市': '7|527',
        '驻马店市': '7|538',
        '信阳市': '7|549',
        '济源市': '7|2780',
        '沈阳市': '8|560',
        '大连市': '8|573',
        '鞍山市': '8|579',
        '抚顺市': '8|584',
        '本溪市': '8|589',
        '丹东市': '8|593',
        '锦州市': '8|598',
        '葫芦岛市': '8|604',
        '营口市': '8|609',
        '盘锦市': '8|613',
        '阜新市': '8|617',
        '辽阳市': '8|621',
        '朝阳市': '8|632',
        '铁岭市': '8|6858',
        '长春市': '9|639',
        '吉林市': '9|644',
        '四平市': '9|651',
        '辽源市': '9|2992',
        '通化市': '9|657',
        '白山市': '9|664',
        '松原市': '9|674',
        '白城市': '9|681',
        '延边州': '9|687',
        '鹤岗市': '10|727',
        '双鸭山市': '10|731',
        '鸡西市': '10|737',
        '大庆市': '10|742',
        '伊春市': '10|753',
        '牡丹江市': '10|757',
        '佳木斯市': '10|765',
        '七台河市': '10|773',
        '黑河市': '10|776',
        '绥化市': '10|782',
        '大兴安岭地区': '10|793',
        '哈尔滨市': '10|698',
        '齐齐哈尔市': '10|712',
        '呼和浩特市': '11|799',
        '包头市': '11|805',
        '乌海市': '11|810',
        '赤峰市': '11|812',
        '乌兰察布市': '11|823',
        '锡林郭勒盟': '11|835',
        '呼伦贝尔市': '11|848',
        '鄂尔多斯市': '11|870',
        '巴彦淖尔市': '11|880',
        '阿拉善盟': '11|891',
        '兴安盟': '11|895',
        '通辽市': '11|902',
        '南京市': '12|904',
        '徐州市': '12|911',
        '连云港市': '12|919',
        '淮安市': '12|925',
        '宿迁市': '12|933',
        '盐城市': '12|939',
        '扬州市': '12|951',
        '泰州市': '12|959',
        '南通市': '12|965',
        '镇江市': '12|972',
        '常州市': '12|978',
        '无锡市': '12|984',
        '苏州市': '12|988',
        '济宁市': '13|2900',
        '济南市': '13|1000',
        '青岛市': '13|1007',
        '淄博市': '13|1016',
        '枣庄市': '13|1022',
        '东营市': '13|1025',
        '潍坊市': '13|1032',
        '烟台市': '13|1042',
        '威海市': '13|1053',
        '莱芜市': '13|1058',
        '德州市': '13|1060',
        '临沂市': '13|1072',
        '聊城市': '13|1081',
        '滨州市': '13|1090',
        '菏泽市': '13|1099',
        '日照市': '13|1108',
        '泰安市': '13|1112',
        '黄山市': '14|1151',
        '滁州市': '14|1159',
        '阜阳市': '14|1167',
        '亳州市': '14|1174',
        '宿州市': '14|1180',
        '池州市': '14|1201',
        '六安市': '14|1206',
        '宣城市': '14|2971',
        '铜陵市': '14|1114',
        '合肥市': '14|1116',
        '淮南市': '14|1121',
        '淮北市': '14|1124',
        '芜湖市': '14|1127',
        '蚌埠市': '14|1132',
        '马鞍山市': '14|1137',
        '安庆市': '14|1140',
        '宁波市': '15|1158',
        '衢州市': '15|1273',
        '丽水市': '15|1280',
        '台州市': '15|1290',
        '舟山市': '15|1298',
        '杭州市': '15|1213',
        '温州市': '15|1233',
        '嘉兴市': '15|1243',
        '湖州市': '15|1250',
        '绍兴市': '15|1255',
        '金华市': '15|1262',
        '福州市': '16|1303',
        '厦门市': '16|1315',
        '三明市': '16|1317',
        '莆田市': '16|1329',
        '泉州市': '16|1332',
        '漳州市': '16|1341',
        '南平市': '16|1352',
        '龙岩市': '16|1362',
        '宁德市': '16|1370',
        '孝感市': '17|1432',
        '黄冈市': '17|1441',
        '咸宁市': '17|1458',
        '恩施州': '17|1466',
        '鄂州市': '17|1475',
        '荆门市': '17|1477',
        '随州市': '17|1479',
        '神农架林区': '17|3154',
        '武汉市': '17|1381',
        '黄石市': '17|1387',
        '襄阳市': '17|1396',
        '十堰市': '17|1405',
        '荆州市': '17|1413',
        '宜昌市': '17|1421',
        '潜江市': '17|2922',
        '天门市': '17|2980',
        '仙桃市': '17|2983',
        '长沙市': '18|1482',
        '株洲市': '18|1488',
        '湘潭市': '18|1495',
        '衡阳市': '18|1501',
        '邵阳市': '18|1511',
        '岳阳市': '18|1522',
        '常德市': '18|1530',
        '张家界市': '18|1540',
        '郴州市': '18|1544',
        '益阳市': '18|1555',
        '永州市': '18|1560',
        '怀化市': '18|1574',
        '娄底市': '18|1586',
        '湘西州': '18|1592',
        '广州市': '19|1601',
        '深圳市': '19|1607',
        '珠海市': '19|1609',
        '汕头市': '19|1611',
        '韶关市': '19|1617',
        '河源市': '19|1627',
        '梅州市': '19|1634',
        '揭阳市': '19|1709',
        '惠州市': '19|1643',
        '汕尾市': '19|1650',
        '东莞市': '19|1655',
        '中山市': '19|1657',
        '江门市': '19|1659',
        '佛山市': '19|1666',
        '阳江市': '19|1672',
        '湛江市': '19|1677',
        '茂名市': '19|1684',
        '肇庆市': '19|1690',
        '云浮市': '19|1698',
        '清远市': '19|1704',
        '潮州市': '19|1705',
        '崇左市': '20|3168',
        '南宁市': '20|1715',
        '柳州市': '20|1720',
        '桂林市': '20|1726',
        '梧州市': '20|1740',
        '北海市': '20|1746',
        '防城港市': '20|1749',
        '钦州市': '20|1753',
        '贵港市': '20|1757',
        '玉林市': '20|1761',
        '贺州市': '20|1792',
        '百色市': '20|1806',
        '河池市': '20|1818',
        '来宾市': '20|3044',
        '南昌市': '21|1827',
        '景德镇市': '21|1832',
        '萍乡市': '21|1836',
        '新余市': '21|1842',
        '九江市': '21|1845',
        '鹰潭市': '21|1857',
        '上饶市': '21|1861',
        '宜春市': '21|1874',
        '抚州市': '21|1885',
        '吉安市': '21|1898',
        '赣州市': '21|1911',
        '凉山州': '22|2103',
        '成都市': '22|1930',
        '自贡市': '22|1946',
        '攀枝花市': '22|1950',
        '泸州市': '22|1954',
        '绵阳市': '22|1960',
        '德阳市': '22|1962',
        '广元市': '22|1977',
        '遂宁市': '22|1983',
        '内江市': '22|1988',
        '乐山市': '22|1993',
        '宜宾市': '22|2005',
        '广安市': '22|2016',
        '南充市': '22|2022',
        '达州市': '22|2033',
        '巴中市': '22|2042',
        '雅安市': '22|2047',
        '眉山市': '22|2058',
        '资阳市': '22|2065',
        '阿坝州': '22|2070',
        '甘孜州': '22|2084',
        '三亚市': '23|3690',
        '文昌市': '23|3698',
        '五指山市': '23|3699',
        '临高县': '23|3701',
        '澄迈县': '23|3702',
        '定安县': '23|3703',
        '屯昌县': '23|3704',
        '昌江县': '23|3705',
        '白沙县': '23|3706',
        '琼中县': '23|3707',
        '陵水县': '23|3708',
        '保亭县': '23|3709',
        '乐东县': '23|3710',
        '三沙市': '23|3711',
        '海口市': '23|2121',
        '琼海市': '23|3115',
        '万宁市': '23|3137',
        '东方市': '23|3173',
        '儋州市': '23|3034',
        '贵阳市': '24|2144',
        '六盘水市': '24|2150',
        '遵义市': '24|2155',
        '铜仁市': '24|2169',
        '毕节市': '24|2180',
        '安顺市': '24|2189',
        '黔西南州': '24|2196',
        '黔东南州': '24|2205',
        '黔南州': '24|2222',
        '迪庆州': '25|4108',
        '昆明市': '25|2235',
        '曲靖市': '25|2247',
        '玉溪市': '25|2258',
        '昭通市': '25|2270',
        '普洱市': '25|2281',
        '临沧市': '25|2291',
        '保山市': '25|2298',
        '丽江市': '25|2304',
        '文山州': '25|2309',
        '红河州': '25|2318',
        '西双版纳州': '25|2332',
        '楚雄州': '25|2336',
        '大理州': '25|2347',
        '德宏州': '25|2360',
        '怒江州': '25|2366',
        '阿里地区': '26|3970',
        '林芝市': '26|3971',
        '拉萨市': '26|2951',
        '那曲地区': '26|3107',
        '山南地区': '26|3129',
        '昌都地区': '26|3138',
        '日喀则地区': '26|3144',
        '延安市': '27|2428',
        '汉中市': '27|2442',
        '榆林市': '27|2454',
        '商洛市': '27|2468',
        '安康市': '27|2476',
        '西安市': '27|2376',
        '铜川市': '27|2386',
        '宝鸡市': '27|2390',
        '咸阳市': '27|2402',
        '渭南市': '27|2416',
        '庆阳市': '28|2525',
        '陇南市': '28|2534',
        '武威市': '28|2544',
        '张掖市': '28|2549',
        '酒泉市': '28|2556',
        '甘南州': '28|2564',
        '临夏州': '28|2573',
        '定西市': '28|3080',
        '兰州市': '28|2487',
        '金昌市': '28|2492',
        '白银市': '28|2495',
        '天水市': '28|2501',
        '嘉峪关市': '28|2509',
        '平凉市': '28|2518',
        '西宁市': '29|2580',
        '海东地区': '29|2585',
        '海北州': '29|2592',
        '黄南州': '29|2597',
        '海南州': '29|2603',
        '果洛州': '29|2605',
        '玉树州': '29|2612',
        '海西州': '29|2620',
        '银川市': '30|2628',
        '石嘴山市': '30|2632',
        '吴忠市': '30|2637',
        '固原市': '30|2644',
        '中卫市': '30|3071',
        '五家渠市': '31|4110',
        '博尔塔拉蒙古自治州阿拉山口口岸': '31|4163',
        '阿拉尔市': '31|15945',
        '图木舒克市': '31|15946',
        '乌鲁木齐市': '31|2652',
        '克拉玛依市': '31|2654',
        '石河子市': '31|2656',
        '吐鲁番地区': '31|2658',
        '哈密地区': '31|2662',
        '和田地区': '31|2666',
        '阿克苏地区': '31|2675',
        '喀什地区': '31|2686',
        '克孜勒苏州': '31|2699',
        '巴音郭楞州': '31|2704',
        '昌吉州': '31|2714',
        '博尔塔拉州': '31|2723',
        '伊犁州': '31|2727',
        '塔城地区': '31|2736',
        '阿勒泰地区': '31|2744',
        '台湾市': '32|2768',
        '钓鱼岛': '84|1310',
        '香港特别行政区': '52993|52994',
        '澳门特别行政区': '52993|52995'
    };
    return common_cityMap;
}
/* city.js for item.default end */
/* location.js for item.main begin */
function common_getProvinceCityMap() {
    var common_provinceCityMap = {
        "1": [
            {
                "id": 72,
                "name": "朝阳区"
            },
            {
                "id": 2800,
                "name": "海淀区"
            },
            {
                "id": 2801,
                "name": "西城区"
            },
            {
                "id": 2802,
                "name": "东城区"
            },
            {
                "id": 2803,
                "name": "崇文区"
            },
            {
                "id": 2804,
                "name": "宣武区"
            },
            {
                "id": 2805,
                "name": "丰台区"
            },
            {
                "id": 2806,
                "name": "石景山区"
            },
            {
                "id": 2807,
                "name": "门头沟"
            },
            {
                "id": 2808,
                "name": "房山区"
            },
            {
                "id": 2809,
                "name": "通州区"
            },
            {
                "id": 2810,
                "name": "大兴区"
            },
            {
                "id": 2812,
                "name": "顺义区"
            },
            {
                "id": 2814,
                "name": "怀柔区"
            },
            {
                "id": 2816,
                "name": "密云区"
            },
            {
                "id": 2901,
                "name": "昌平区"
            },
            {
                "id": 2953,
                "name": "平谷区"
            },
            {
                "id": 3065,
                "name": "延庆县"
            }
        ],
        "2": [
            {
                "id": 2813,
                "name": "徐汇区"
            },
            {
                "id": 2815,
                "name": "长宁区"
            },
            {
                "id": 2817,
                "name": "静安区"
            },
            {
                "id": 2820,
                "name": "闸北区"
            },
            {
                "id": 2822,
                "name": "虹口区"
            },
            {
                "id": 2823,
                "name": "杨浦区"
            },
            {
                "id": 2824,
                "name": "宝山区"
            },
            {
                "id": 2825,
                "name": "闵行区"
            },
            {
                "id": 2826,
                "name": "嘉定区"
            },
            {
                "id": 2830,
                "name": "浦东新区"
            },
            {
                "id": 2833,
                "name": "青浦区"
            },
            {
                "id": 2834,
                "name": "松江区"
            },
            {
                "id": 2835,
                "name": "金山区"
            },
            {
                "id": 2837,
                "name": "奉贤区"
            },
            {
                "id": 2841,
                "name": "普陀区"
            },
            {
                "id": 2919,
                "name": "崇明县"
            },
            {
                "id": 78,
                "name": "黄浦区"
            }
        ],
        "3": [
            {
                "id": 51035,
                "name": "东丽区"
            },
            {
                "id": 51036,
                "name": "和平区"
            },
            {
                "id": 51037,
                "name": "河北区"
            },
            {
                "id": 51038,
                "name": "河东区"
            },
            {
                "id": 51039,
                "name": "河西区"
            },
            {
                "id": 51040,
                "name": "红桥区"
            },
            {
                "id": 51041,
                "name": "蓟县"
            },
            {
                "id": 51042,
                "name": "静海县"
            },
            {
                "id": 51043,
                "name": "南开区"
            },
            {
                "id": 51044,
                "name": "塘沽区"
            },
            {
                "id": 51045,
                "name": "西青区"
            },
            {
                "id": 51046,
                "name": "武清区"
            },
            {
                "id": 51047,
                "name": "津南区"
            },
            {
                "id": 51048,
                "name": "汉沽区"
            },
            {
                "id": 51049,
                "name": "大港区"
            },
            {
                "id": 51050,
                "name": "北辰区"
            },
            {
                "id": 51051,
                "name": "宝坻区"
            },
            {
                "id": 51052,
                "name": "宁河县"
            }
        ],
        "4": [
            {
                "id": 113,
                "name": "万州区"
            },
            {
                "id": 114,
                "name": "涪陵区"
            },
            {
                "id": 115,
                "name": "梁平县"
            },
            {
                "id": 119,
                "name": "南川区"
            },
            {
                "id": 123,
                "name": "潼南县"
            },
            {
                "id": 126,
                "name": "大足区"
            },
            {
                "id": 128,
                "name": "黔江区"
            },
            {
                "id": 129,
                "name": "武隆县"
            },
            {
                "id": 130,
                "name": "丰都县"
            },
            {
                "id": 131,
                "name": "奉节县"
            },
            {
                "id": 132,
                "name": "开县"
            },
            {
                "id": 133,
                "name": "云阳县"
            },
            {
                "id": 134,
                "name": "忠县"
            },
            {
                "id": 135,
                "name": "巫溪县"
            },
            {
                "id": 136,
                "name": "巫山县"
            },
            {
                "id": 137,
                "name": "石柱县"
            },
            {
                "id": 138,
                "name": "彭水县"
            },
            {
                "id": 139,
                "name": "垫江县"
            },
            {
                "id": 140,
                "name": "酉阳县"
            },
            {
                "id": 141,
                "name": "秀山县"
            },
            {
                "id": 48131,
                "name": "璧山县"
            },
            {
                "id": 48132,
                "name": "荣昌县"
            },
            {
                "id": 48133,
                "name": "铜梁县"
            },
            {
                "id": 48201,
                "name": "合川区"
            },
            {
                "id": 48202,
                "name": "巴南区"
            },
            {
                "id": 48203,
                "name": "北碚区"
            },
            {
                "id": 48204,
                "name": "江津区"
            },
            {
                "id": 48205,
                "name": "渝北区"
            },
            {
                "id": 48206,
                "name": "长寿区"
            },
            {
                "id": 48207,
                "name": "永川区"
            },
            {
                "id": 50950,
                "name": "江北区"
            },
            {
                "id": 50951,
                "name": "南岸区"
            },
            {
                "id": 50952,
                "name": "九龙坡区"
            },
            {
                "id": 50953,
                "name": "沙坪坝区"
            },
            {
                "id": 50954,
                "name": "大渡口区"
            },
            {
                "id": 50995,
                "name": "綦江区"
            },
            {
                "id": 51026,
                "name": "渝中区"
            },
            {
                "id": 51027,
                "name": "高新区"
            },
            {
                "id": 51028,
                "name": "北部新区"
            },
            {
                "id": 4164,
                "name": "城口县"
            }
        ],
        "5": [
            {
                "id": 142,
                "name": "石家庄市"
            },
            {
                "id": 148,
                "name": "邯郸市"
            },
            {
                "id": 164,
                "name": "邢台市"
            },
            {
                "id": 199,
                "name": "保定市"
            },
            {
                "id": 224,
                "name": "张家口市"
            },
            {
                "id": 239,
                "name": "承德市"
            },
            {
                "id": 248,
                "name": "秦皇岛市"
            },
            {
                "id": 258,
                "name": "唐山市"
            },
            {
                "id": 264,
                "name": "沧州市"
            },
            {
                "id": 274,
                "name": "廊坊市"
            },
            {
                "id": 275,
                "name": "衡水市"
            }
        ],
        "6": [
            {
                "id": 303,
                "name": "太原市"
            },
            {
                "id": 309,
                "name": "大同市"
            },
            {
                "id": 318,
                "name": "阳泉市"
            },
            {
                "id": 325,
                "name": "晋城市"
            },
            {
                "id": 330,
                "name": "朔州市"
            },
            {
                "id": 336,
                "name": "晋中市"
            },
            {
                "id": 350,
                "name": "忻州市"
            },
            {
                "id": 368,
                "name": "吕梁市"
            },
            {
                "id": 379,
                "name": "临汾市"
            },
            {
                "id": 398,
                "name": "运城市"
            },
            {
                "id": 3074,
                "name": "长治市"
            }
        ],
        "7": [
            {
                "id": 412,
                "name": "郑州市"
            },
            {
                "id": 420,
                "name": "开封市"
            },
            {
                "id": 427,
                "name": "洛阳市"
            },
            {
                "id": 438,
                "name": "平顶山市"
            },
            {
                "id": 446,
                "name": "焦作市"
            },
            {
                "id": 454,
                "name": "鹤壁市"
            },
            {
                "id": 458,
                "name": "新乡市"
            },
            {
                "id": 468,
                "name": "安阳市"
            },
            {
                "id": 475,
                "name": "濮阳市"
            },
            {
                "id": 482,
                "name": "许昌市"
            },
            {
                "id": 489,
                "name": "漯河市"
            },
            {
                "id": 495,
                "name": "三门峡市"
            },
            {
                "id": 502,
                "name": "南阳市"
            },
            {
                "id": 517,
                "name": "商丘市"
            },
            {
                "id": 527,
                "name": "周口市"
            },
            {
                "id": 538,
                "name": "驻马店市"
            },
            {
                "id": 549,
                "name": "信阳市"
            },
            {
                "id": 2780,
                "name": "济源市"
            }
        ],
        "8": [
            {
                "id": 560,
                "name": "沈阳市"
            },
            {
                "id": 573,
                "name": "大连市"
            },
            {
                "id": 579,
                "name": "鞍山市"
            },
            {
                "id": 584,
                "name": "抚顺市"
            },
            {
                "id": 589,
                "name": "本溪市"
            },
            {
                "id": 593,
                "name": "丹东市"
            },
            {
                "id": 598,
                "name": "锦州市"
            },
            {
                "id": 604,
                "name": "葫芦岛市"
            },
            {
                "id": 609,
                "name": "营口市"
            },
            {
                "id": 613,
                "name": "盘锦市"
            },
            {
                "id": 617,
                "name": "阜新市"
            },
            {
                "id": 621,
                "name": "辽阳市"
            },
            {
                "id": 632,
                "name": "朝阳市"
            },
            {
                "id": 6858,
                "name": "铁岭市"
            }
        ],
        "9": [
            {
                "id": 639,
                "name": "长春市"
            },
            {
                "id": 644,
                "name": "吉林市"
            },
            {
                "id": 651,
                "name": "四平市"
            },
            {
                "id": 2992,
                "name": "辽源市"
            },
            {
                "id": 657,
                "name": "通化市"
            },
            {
                "id": 664,
                "name": "白山市"
            },
            {
                "id": 674,
                "name": "松原市"
            },
            {
                "id": 681,
                "name": "白城市"
            },
            {
                "id": 687,
                "name": "延边州"
            }
        ],
        "10": [
            {
                "id": 727,
                "name": "鹤岗市"
            },
            {
                "id": 731,
                "name": "双鸭山市"
            },
            {
                "id": 737,
                "name": "鸡西市"
            },
            {
                "id": 742,
                "name": "大庆市"
            },
            {
                "id": 753,
                "name": "伊春市"
            },
            {
                "id": 757,
                "name": "牡丹江市"
            },
            {
                "id": 765,
                "name": "佳木斯市"
            },
            {
                "id": 773,
                "name": "七台河市"
            },
            {
                "id": 776,
                "name": "黑河市"
            },
            {
                "id": 782,
                "name": "绥化市"
            },
            {
                "id": 793,
                "name": "大兴安岭地区"
            },
            {
                "id": 698,
                "name": "哈尔滨市"
            },
            {
                "id": 712,
                "name": "齐齐哈尔市"
            }
        ],
        "11": [
            {
                "id": 799,
                "name": "呼和浩特市"
            },
            {
                "id": 805,
                "name": "包头市"
            },
            {
                "id": 810,
                "name": "乌海市"
            },
            {
                "id": 812,
                "name": "赤峰市"
            },
            {
                "id": 823,
                "name": "乌兰察布市"
            },
            {
                "id": 835,
                "name": "锡林郭勒盟"
            },
            {
                "id": 848,
                "name": "呼伦贝尔市"
            },
            {
                "id": 870,
                "name": "鄂尔多斯市"
            },
            {
                "id": 880,
                "name": "巴彦淖尔市"
            },
            {
                "id": 891,
                "name": "阿拉善盟"
            },
            {
                "id": 895,
                "name": "兴安盟"
            },
            {
                "id": 902,
                "name": "通辽市"
            }
        ],
        "12": [
            {
                "id": 904,
                "name": "南京市"
            },
            {
                "id": 911,
                "name": "徐州市"
            },
            {
                "id": 919,
                "name": "连云港市"
            },
            {
                "id": 925,
                "name": "淮安市"
            },
            {
                "id": 933,
                "name": "宿迁市"
            },
            {
                "id": 939,
                "name": "盐城市"
            },
            {
                "id": 951,
                "name": "扬州市"
            },
            {
                "id": 959,
                "name": "泰州市"
            },
            {
                "id": 965,
                "name": "南通市"
            },
            {
                "id": 972,
                "name": "镇江市"
            },
            {
                "id": 978,
                "name": "常州市"
            },
            {
                "id": 984,
                "name": "无锡市"
            },
            {
                "id": 988,
                "name": "苏州市"
            }
        ],
        "13": [
            {
                "id": 2900,
                "name": "济宁市"
            },
            {
                "id": 1000,
                "name": "济南市"
            },
            {
                "id": 1007,
                "name": "青岛市"
            },
            {
                "id": 1016,
                "name": "淄博市"
            },
            {
                "id": 1022,
                "name": "枣庄市"
            },
            {
                "id": 1025,
                "name": "东营市"
            },
            {
                "id": 1032,
                "name": "潍坊市"
            },
            {
                "id": 1042,
                "name": "烟台市"
            },
            {
                "id": 1053,
                "name": "威海市"
            },
            {
                "id": 1058,
                "name": "莱芜市"
            },
            {
                "id": 1060,
                "name": "德州市"
            },
            {
                "id": 1072,
                "name": "临沂市"
            },
            {
                "id": 1081,
                "name": "聊城市"
            },
            {
                "id": 1090,
                "name": "滨州市"
            },
            {
                "id": 1099,
                "name": "菏泽市"
            },
            {
                "id": 1108,
                "name": "日照市"
            },
            {
                "id": 1112,
                "name": "泰安市"
            }
        ],
        "14": [
            {
                "id": 1151,
                "name": "黄山市"
            },
            {
                "id": 1159,
                "name": "滁州市"
            },
            {
                "id": 1167,
                "name": "阜阳市"
            },
            {
                "id": 1174,
                "name": "亳州市"
            },
            {
                "id": 1180,
                "name": "宿州市"
            },
            {
                "id": 1201,
                "name": "池州市"
            },
            {
                "id": 1206,
                "name": "六安市"
            },
            {
                "id": 2971,
                "name": "宣城市"
            },
            {
                "id": 1114,
                "name": "铜陵市"
            },
            {
                "id": 1116,
                "name": "合肥市"
            },
            {
                "id": 1121,
                "name": "淮南市"
            },
            {
                "id": 1124,
                "name": "淮北市"
            },
            {
                "id": 1127,
                "name": "芜湖市"
            },
            {
                "id": 1132,
                "name": "蚌埠市"
            },
            {
                "id": 1137,
                "name": "马鞍山市"
            },
            {
                "id": 1140,
                "name": "安庆市"
            }
        ],
        "15": [
            {
                "id": 1158,
                "name": "宁波市"
            },
            {
                "id": 1273,
                "name": "衢州市"
            },
            {
                "id": 1280,
                "name": "丽水市"
            },
            {
                "id": 1290,
                "name": "台州市"
            },
            {
                "id": 1298,
                "name": "舟山市"
            },
            {
                "id": 1213,
                "name": "杭州市"
            },
            {
                "id": 1233,
                "name": "温州市"
            },
            {
                "id": 1243,
                "name": "嘉兴市"
            },
            {
                "id": 1250,
                "name": "湖州市"
            },
            {
                "id": 1255,
                "name": "绍兴市"
            },
            {
                "id": 1262,
                "name": "金华市"
            }
        ],
        "16": [
            {
                "id": 1303,
                "name": "福州市"
            },
            {
                "id": 1315,
                "name": "厦门市"
            },
            {
                "id": 1317,
                "name": "三明市"
            },
            {
                "id": 1329,
                "name": "莆田市"
            },
            {
                "id": 1332,
                "name": "泉州市"
            },
            {
                "id": 1341,
                "name": "漳州市"
            },
            {
                "id": 1352,
                "name": "南平市"
            },
            {
                "id": 1362,
                "name": "龙岩市"
            },
            {
                "id": 1370,
                "name": "宁德市"
            }
        ],
        "17": [
            {
                "id": 1432,
                "name": "孝感市"
            },
            {
                "id": 1441,
                "name": "黄冈市"
            },
            {
                "id": 1458,
                "name": "咸宁市"
            },
            {
                "id": 1466,
                "name": "恩施州"
            },
            {
                "id": 1475,
                "name": "鄂州市"
            },
            {
                "id": 1477,
                "name": "荆门市"
            },
            {
                "id": 1479,
                "name": "随州市"
            },
            {
                "id": 3154,
                "name": "神农架林区"
            },
            {
                "id": 1381,
                "name": "武汉市"
            },
            {
                "id": 1387,
                "name": "黄石市"
            },
            {
                "id": 1396,
                "name": "襄阳市"
            },
            {
                "id": 1405,
                "name": "十堰市"
            },
            {
                "id": 1413,
                "name": "荆州市"
            },
            {
                "id": 1421,
                "name": "宜昌市"
            },
            {
                "id": 2922,
                "name": "潜江市"
            },
            {
                "id": 2980,
                "name": "天门市"
            },
            {
                "id": 2983,
                "name": "仙桃市"
            }
        ],
        "18": [
            {
                "id": 1482,
                "name": "长沙市"
            },
            {
                "id": 1488,
                "name": "株洲市"
            },
            {
                "id": 1495,
                "name": "湘潭市"
            },
            {
                "id": 1501,
                "name": "衡阳市"
            },
            {
                "id": 1511,
                "name": "邵阳市"
            },
            {
                "id": 1522,
                "name": "岳阳市"
            },
            {
                "id": 1530,
                "name": "常德市"
            },
            {
                "id": 1540,
                "name": "张家界市"
            },
            {
                "id": 1544,
                "name": "郴州市"
            },
            {
                "id": 1555,
                "name": "益阳市"
            },
            {
                "id": 1560,
                "name": "永州市"
            },
            {
                "id": 1574,
                "name": "怀化市"
            },
            {
                "id": 1586,
                "name": "娄底市"
            },
            {
                "id": 1592,
                "name": "湘西州"
            }
        ],
        "19": [
            {
                "id": 1601,
                "name": "广州市"
            },
            {
                "id": 1607,
                "name": "深圳市"
            },
            {
                "id": 1609,
                "name": "珠海市"
            },
            {
                "id": 1611,
                "name": "汕头市"
            },
            {
                "id": 1617,
                "name": "韶关市"
            },
            {
                "id": 1627,
                "name": "河源市"
            },
            {
                "id": 1634,
                "name": "梅州市"
            },
            {
                "id": 1709,
                "name": "揭阳市"
            },
            {
                "id": 1643,
                "name": "惠州市"
            },
            {
                "id": 1650,
                "name": "汕尾市"
            },
            {
                "id": 1655,
                "name": "东莞市"
            },
            {
                "id": 1657,
                "name": "中山市"
            },
            {
                "id": 1659,
                "name": "江门市"
            },
            {
                "id": 1666,
                "name": "佛山市"
            },
            {
                "id": 1672,
                "name": "阳江市"
            },
            {
                "id": 1677,
                "name": "湛江市"
            },
            {
                "id": 1684,
                "name": "茂名市"
            },
            {
                "id": 1690,
                "name": "肇庆市"
            },
            {
                "id": 1698,
                "name": "云浮市"
            },
            {
                "id": 1704,
                "name": "清远市"
            },
            {
                "id": 1705,
                "name": "潮州市"
            }
        ],
        "20": [
            {
                "id": 3168,
                "name": "崇左市"
            },
            {
                "id": 1715,
                "name": "南宁市"
            },
            {
                "id": 1720,
                "name": "柳州市"
            },
            {
                "id": 1726,
                "name": "桂林市"
            },
            {
                "id": 1740,
                "name": "梧州市"
            },
            {
                "id": 1746,
                "name": "北海市"
            },
            {
                "id": 1749,
                "name": "防城港市"
            },
            {
                "id": 1753,
                "name": "钦州市"
            },
            {
                "id": 1757,
                "name": "贵港市"
            },
            {
                "id": 1761,
                "name": "玉林市"
            },
            {
                "id": 1792,
                "name": "贺州市"
            },
            {
                "id": 1806,
                "name": "百色市"
            },
            {
                "id": 1818,
                "name": "河池市"
            },
            {
                "id": 3044,
                "name": "来宾市"
            }
        ],
        "21": [
            {
                "id": 1827,
                "name": "南昌市"
            },
            {
                "id": 1832,
                "name": "景德镇市"
            },
            {
                "id": 1836,
                "name": "萍乡市"
            },
            {
                "id": 1842,
                "name": "新余市"
            },
            {
                "id": 1845,
                "name": "九江市"
            },
            {
                "id": 1857,
                "name": "鹰潭市"
            },
            {
                "id": 1861,
                "name": "上饶市"
            },
            {
                "id": 1874,
                "name": "宜春市"
            },
            {
                "id": 1885,
                "name": "抚州市"
            },
            {
                "id": 1898,
                "name": "吉安市"
            },
            {
                "id": 1911,
                "name": "赣州市"
            }
        ],
        "22": [
            {
                "id": 2103,
                "name": "凉山州"
            },
            {
                "id": 1930,
                "name": "成都市"
            },
            {
                "id": 1946,
                "name": "自贡市"
            },
            {
                "id": 1950,
                "name": "攀枝花市"
            },
            {
                "id": 1954,
                "name": "泸州市"
            },
            {
                "id": 1960,
                "name": "绵阳市"
            },
            {
                "id": 1962,
                "name": "德阳市"
            },
            {
                "id": 1977,
                "name": "广元市"
            },
            {
                "id": 1983,
                "name": "遂宁市"
            },
            {
                "id": 1988,
                "name": "内江市"
            },
            {
                "id": 1993,
                "name": "乐山市"
            },
            {
                "id": 2005,
                "name": "宜宾市"
            },
            {
                "id": 2016,
                "name": "广安市"
            },
            {
                "id": 2022,
                "name": "南充市"
            },
            {
                "id": 2033,
                "name": "达州市"
            },
            {
                "id": 2042,
                "name": "巴中市"
            },
            {
                "id": 2047,
                "name": "雅安市"
            },
            {
                "id": 2058,
                "name": "眉山市"
            },
            {
                "id": 2065,
                "name": "资阳市"
            },
            {
                "id": 2070,
                "name": "阿坝州"
            },
            {
                "id": 2084,
                "name": "甘孜州"
            }
        ],
        "23": [
            {
                "id": 3690,
                "name": "三亚市"
            },
            {
                "id": 3698,
                "name": "文昌市"
            },
            {
                "id": 3699,
                "name": "五指山市"
            },
            {
                "id": 3701,
                "name": "临高县"
            },
            {
                "id": 3702,
                "name": "澄迈县"
            },
            {
                "id": 3703,
                "name": "定安县"
            },
            {
                "id": 3704,
                "name": "屯昌县"
            },
            {
                "id": 3705,
                "name": "昌江县"
            },
            {
                "id": 3706,
                "name": "白沙县"
            },
            {
                "id": 3707,
                "name": "琼中县"
            },
            {
                "id": 3708,
                "name": "陵水县"
            },
            {
                "id": 3709,
                "name": "保亭县"
            },
            {
                "id": 3710,
                "name": "乐东县"
            },
            {
                "id": 3711,
                "name": "三沙市"
            },
            {
                "id": 2121,
                "name": "海口市"
            },
            {
                "id": 3115,
                "name": "琼海市"
            },
            {
                "id": 3137,
                "name": "万宁市"
            },
            {
                "id": 3173,
                "name": "东方市"
            },
            {
                "id": 3034,
                "name": "儋州市"
            }
        ],
        "24": [
            {
                "id": 2144,
                "name": "贵阳市"
            },
            {
                "id": 2150,
                "name": "六盘水市"
            },
            {
                "id": 2155,
                "name": "遵义市"
            },
            {
                "id": 2169,
                "name": "铜仁市"
            },
            {
                "id": 2180,
                "name": "毕节市"
            },
            {
                "id": 2189,
                "name": "安顺市"
            },
            {
                "id": 2196,
                "name": "黔西南州"
            },
            {
                "id": 2205,
                "name": "黔东南州"
            },
            {
                "id": 2222,
                "name": "黔南州"
            }
        ],
        "25": [
            {
                "id": 4108,
                "name": "迪庆州"
            },
            {
                "id": 2235,
                "name": "昆明市"
            },
            {
                "id": 2247,
                "name": "曲靖市"
            },
            {
                "id": 2258,
                "name": "玉溪市"
            },
            {
                "id": 2270,
                "name": "昭通市"
            },
            {
                "id": 2281,
                "name": "普洱市"
            },
            {
                "id": 2291,
                "name": "临沧市"
            },
            {
                "id": 2298,
                "name": "保山市"
            },
            {
                "id": 2304,
                "name": "丽江市"
            },
            {
                "id": 2309,
                "name": "文山州"
            },
            {
                "id": 2318,
                "name": "红河州"
            },
            {
                "id": 2332,
                "name": "西双版纳州"
            },
            {
                "id": 2336,
                "name": "楚雄州"
            },
            {
                "id": 2347,
                "name": "大理州"
            },
            {
                "id": 2360,
                "name": "德宏州"
            },
            {
                "id": 2366,
                "name": "怒江州"
            }
        ],
        "26": [
            {
                "id": 3970,
                "name": "阿里地区"
            },
            {
                "id": 3971,
                "name": "林芝地区"
            },
            {
                "id": 2951,
                "name": "拉萨市"
            },
            {
                "id": 3107,
                "name": "那曲地区"
            },
            {
                "id": 3129,
                "name": "山南地区"
            },
            {
                "id": 3138,
                "name": "昌都地区"
            },
            {
                "id": 3144,
                "name": "日喀则地区"
            }
        ],
        "27": [
            {
                "id": 2428,
                "name": "延安市"
            },
            {
                "id": 2442,
                "name": "汉中市"
            },
            {
                "id": 2454,
                "name": "榆林市"
            },
            {
                "id": 2468,
                "name": "商洛市"
            },
            {
                "id": 2476,
                "name": "安康市"
            },
            {
                "id": 2376,
                "name": "西安市"
            },
            {
                "id": 2386,
                "name": "铜川市"
            },
            {
                "id": 2390,
                "name": "宝鸡市"
            },
            {
                "id": 2402,
                "name": "咸阳市"
            },
            {
                "id": 2416,
                "name": "渭南市"
            }
        ],
        "28": [
            {
                "id": 2525,
                "name": "庆阳市"
            },
            {
                "id": 2534,
                "name": "陇南市"
            },
            {
                "id": 2544,
                "name": "武威市"
            },
            {
                "id": 2549,
                "name": "张掖市"
            },
            {
                "id": 2556,
                "name": "酒泉市"
            },
            {
                "id": 2564,
                "name": "甘南州"
            },
            {
                "id": 2573,
                "name": "临夏州"
            },
            {
                "id": 3080,
                "name": "定西市"
            },
            {
                "id": 2487,
                "name": "兰州市"
            },
            {
                "id": 2492,
                "name": "金昌市"
            },
            {
                "id": 2495,
                "name": "白银市"
            },
            {
                "id": 2501,
                "name": "天水市"
            },
            {
                "id": 2509,
                "name": "嘉峪关市"
            },
            {
                "id": 2518,
                "name": "平凉市"
            }
        ],
        "29": [
            {
                "id": 2580,
                "name": "西宁市"
            },
            {
                "id": 2585,
                "name": "海东地区"
            },
            {
                "id": 2592,
                "name": "海北州"
            },
            {
                "id": 2597,
                "name": "黄南州"
            },
            {
                "id": 2603,
                "name": "海南州"
            },
            {
                "id": 2605,
                "name": "果洛州"
            },
            {
                "id": 2612,
                "name": "玉树州"
            },
            {
                "id": 2620,
                "name": "海西州"
            }
        ],
        "30": [
            {
                "id": 2628,
                "name": "银川市"
            },
            {
                "id": 2632,
                "name": "石嘴山市"
            },
            {
                "id": 2637,
                "name": "吴忠市"
            },
            {
                "id": 2644,
                "name": "固原市"
            },
            {
                "id": 3071,
                "name": "中卫市"
            }
        ],
        "31": [
            {
                "id": 4110,
                "name": "五家渠市"
            },
            {
                "id": 4163,
                "name": "博尔塔拉蒙古自治州阿拉山口口岸"
            },
            {
                "id": 15945,
                "name": "阿拉尔市"
            },
            {
                "id": 15946,
                "name": "图木舒克市"
            },
            {
                "id": 2652,
                "name": "乌鲁木齐市"
            },
            {
                "id": 2654,
                "name": "克拉玛依市"
            },
            {
                "id": 2656,
                "name": "石河子市"
            },
            {
                "id": 2658,
                "name": "吐鲁番地区"
            },
            {
                "id": 2662,
                "name": "哈密地区"
            },
            {
                "id": 2666,
                "name": "和田地区"
            },
            {
                "id": 2675,
                "name": "阿克苏地区"
            },
            {
                "id": 2686,
                "name": "喀什地区"
            },
            {
                "id": 2699,
                "name": "克孜勒苏州"
            },
            {
                "id": 2704,
                "name": "巴音郭楞州"
            },
            {
                "id": 2714,
                "name": "昌吉州"
            },
            {
                "id": 2723,
                "name": "博尔塔拉州"
            },
            {
                "id": 2727,
                "name": "伊犁州"
            },
            {
                "id": 2736,
                "name": "塔城地区"
            },
            {
                "id": 2744,
                "name": "阿勒泰地区"
            }
        ],
        "32": [
            {
                "id": 2768,
                "name": "台湾市"
            }
        ],
        "42": [
            {
                "id": 2754,
                "name": "香港特别行政区"
            }
        ],
        "43": [
            {
                "id": 2770,
                "name": "澳门市"
            }
        ],
        "84": [
            {
                "id": 1310,
                "name": "钓鱼岛"
            }
        ],
        '53283': {
            'A': [
                {
                    id: 53285,
                    name: '阿尔巴尼亚'
                },
                {
                    id: 53296,
                    name: '阿尔及利亚'
                },
                {
                    id: 53284,
                    name: '阿富汗'
                },
                {
                    id: 53297,
                    name: '阿根廷'
                },
                {
                    id: 53300,
                    name: '阿联酋'
                },
                {
                    id: 53302,
                    name: '阿鲁巴'
                },
                {
                    id: 53495,
                    name: '阿曼'
                },
                {
                    id: 53315,
                    name: '阿塞拜疆'
                },
                {
                    id: 53320,
                    name: '埃及'
                },
                {
                    id: 53336,
                    name: '埃塞俄比亚'
                },
                {
                    id: 53337,
                    name: '爱尔兰'
                },
                {
                    id: 53338,
                    name: '爱沙尼亚'
                },
                {
                    id: 53339,
                    name: '安道尔'
                },
                {
                    id: 53341,
                    name: '安哥拉'
                },
                {
                    id: 53343,
                    name: '安圭拉'
                },
                {
                    id: 53346,
                    name: '奥地利'
                },
                {
                    id: 53347,
                    name: '澳大利亚'
                },
                {
                    id: 53344,
                    name: '安提瓜和巴布达'
                }
            ],
            'B': [
                {
                    id: 53349,
                    name: '巴巴多斯'
                },
                {
                    id: 53352,
                    name: '巴哈马'
                },
                {
                    id: 53353,
                    name: '巴基斯坦'
                },
                {
                    id: 53354,
                    name: '巴拉圭'
                },
                {
                    id: 53355,
                    name: '巴林'
                },
                {
                    id: 53356,
                    name: '巴拿马'
                },
                {
                    id: 53357,
                    name: '巴西'
                },
                {
                    id: 53359,
                    name: '白俄罗斯'
                },
                {
                    id: 53361,
                    name: '百慕大三角'
                },
                {
                    id: 53362,
                    name: '保加利亚'
                },
                {
                    id: 53365,
                    name: '贝宁'
                },
                {
                    id: 53367,
                    name: '比利时'
                },
                {
                    id: 53368,
                    name: '冰岛'
                },
                {
                    id: 53370,
                    name: '波多黎各'
                },
                {
                    id: 53372,
                    name: '波兰'
                },
                {
                    id: 53375,
                    name: '玻利维亚'
                },
                {
                    id: 53377,
                    name: '伯利兹'
                },
                {
                    id: 53379,
                    name: '博茨瓦纳'
                },
                {
                    id: 53380,
                    name: '不丹'
                },
                {
                    id: 53384,
                    name: '布隆迪'
                },
                {
                    id: 53382,
                    name: '布基纳法索'
                },
                {
                    id: 53350,
                    name: '巴布亚新几内亚'
                },
                {
                    id: 53374,
                    name: '波斯尼亚和黑塞哥维那'
                }
            ],
            'CDEF': [
                {
                    id: 53387,
                    name: '丹麦'
                },
                {
                    id: 53389,
                    name: '德国'
                },
                {
                    id: 53391,
                    name: '东帝汶'
                },
                {
                    id: 53392,
                    name: '多哥'
                },
                {
                    id: 53395,
                    name: '俄罗斯'
                },
                {
                    id: 53396,
                    name: '厄瓜多尔'
                },
                {
                    id: 53398,
                    name: '法国'
                },
                {
                    id: 53399,
                    name: '法罗群岛'
                },
                {
                    id: 53401,
                    name: '菲律宾'
                },
                {
                    id: 53403,
                    name: '斐济群岛'
                },
                {
                    id: 53405,
                    name: '芬兰'
                },
                {
                    id: 53406,
                    name: '佛得角'
                },
                {
                    id: 53400,
                    name: '法属圭亚那'
                },
                {
                    id: 53397,
                    name: '厄立特里亚'
                },
                {
                    id: 53386,
                    name: '赤道几内亚'
                },
                {
                    id: 53394,
                    name: '多米尼加共和国'
                }
            ],
            'GH': [
                {
                    id: 53407,
                    name: '冈比亚'
                },
                {
                    id: 53408,
                    name: '刚果'
                },
                {
                    id: 53409,
                    name: '哥伦比亚'
                },
                {
                    id: 53410,
                    name: '哥斯达黎加'
                },
                {
                    id: 53411,
                    name: '格林纳达'
                },
                {
                    id: 53412,
                    name: '格陵兰'
                },
                {
                    id: 53413,
                    name: '格鲁吉亚'
                },
                {
                    id: 53414,
                    name: '古巴'
                },
                {
                    id: 53415,
                    name: '瓜德罗普'
                },
                {
                    id: 53417,
                    name: '关岛'
                },
                {
                    id: 53419,
                    name: '圭亚那'
                },
                {
                    id: 53420,
                    name: '哈萨克斯坦'
                },
                {
                    id: 53421,
                    name: '海地'
                },
                {
                    id: 53422,
                    name: '韩国'
                },
                {
                    id: 53423,
                    name: '荷兰'
                },
                {
                    id: 53425,
                    name: '黑山'
                },
                {
                    id: 53426,
                    name: '洪都拉斯'
                }
            ],
            'JK': [
                {
                    id: 53430,
                    name: '吉布提'
                },
                {
                    id: 53434,
                    name: '几内亚'
                },
                {
                    id: 53436,
                    name: '几内亚比绍'
                },
                {
                    id: 53440,
                    name: '加拿大'
                },
                {
                    id: 53442,
                    name: '加纳'
                },
                {
                    id: 53444,
                    name: '加蓬'
                },
                {
                    id: 53445,
                    name: '柬埔寨'
                },
                {
                    id: 53447,
                    name: '捷克'
                },
                {
                    id: 53449,
                    name: '津巴布韦'
                },
                {
                    id: 53451,
                    name: '喀麦隆'
                },
                {
                    id: 53453,
                    name: '卡塔尔'
                },
                {
                    id: 53455,
                    name: '开曼群岛'
                },
                {
                    id: 53457,
                    name: '科摩罗'
                },
                {
                    id: 53458,
                    name: '科特迪瓦'
                },
                {
                    id: 53460,
                    name: '科威特'
                },
                {
                    id: 53461,
                    name: '克罗地亚'
                },
                {
                    id: 53463,
                    name: '肯尼亚'
                },
                {
                    id: 53464,
                    name: '库克群岛'
                },
                {
                    id: 53432,
                    name: '吉尔吉斯斯坦'
                }
            ],
            'L': [
                {
                    id: 53466,
                    name: '拉脱维亚'
                },
                {
                    id: 53467,
                    name: '莱索托'
                },
                {
                    id: 53476,
                    name: '老挝'
                },
                {
                    id: 53479,
                    name: '黎巴嫩'
                },
                {
                    id: 53481,
                    name: '立陶宛'
                },
                {
                    id: 53482,
                    name: '利比里亚'
                },
                {
                    id: 53484,
                    name: '利比亚'
                },
                {
                    id: 53486,
                    name: '列支敦士登'
                },
                {
                    id: 53491,
                    name: '卢森堡'
                },
                {
                    id: 53493,
                    name: '卢旺达'
                },
                {
                    id: 53494,
                    name: '罗马尼亚'
                }
            ],
            'M': [
                {
                    id: 53298,
                    name: '马尔代夫'
                },
                {
                    id: 53299,
                    name: '马耳他'
                },
                {
                    id: 53301,
                    name: '马拉维'
                },
                {
                    id: 53303,
                    name: '马来西亚'
                },
                {
                    id: 53304,
                    name: '马里'
                },
                {
                    id: 53305,
                    name: '马其顿'
                },
                {
                    id: 5***REMOVED***,
                    name: '马提尼克'
                },
                {
                    id: 53307,
                    name: '毛里求斯'
                },
                {
                    id: 53308,
                    name: '毛里塔尼亚'
                },
                {
                    id: 53309,
                    name: '美国'
                },
                {
                    id: 53286,
                    name: '美属萨摩亚'
                },
                {
                    id: 53311,
                    name: '蒙古'
                },
                {
                    id: 53312,
                    name: '蒙特塞拉特'
                },
                {
                    id: 53313,
                    name: '孟加拉'
                },
                {
                    id: 53314,
                    name: '秘鲁'
                },
                {
                    id: 53317,
                    name: '摩尔多瓦'
                },
                {
                    id: 53318,
                    name: '摩洛哥'
                },
                {
                    id: 53319,
                    name: '摩纳哥'
                },
                {
                    id: 53321,
                    name: '莫桑比克'
                },
                {
                    id: 53322,
                    name: '墨西哥'
                },
                {
                    id: 53316,
                    name: '密克罗尼西亚'
                },
                {
                    id: 53310,
                    name: '美属维尔京群岛'
                },
                {
                    id: 53496,
                    name: '马达加斯加'
                }
            ],
            'NPR': [
                {
                    id: 53323,
                    name: '纳米比亚'
                },
                {
                    id: 53324,
                    name: '南非'
                },
                {
                    id: 53325,
                    name: '南苏丹'
                },
                {
                    id: 53326,
                    name: '尼泊尔'
                },
                {
                    id: 53327,
                    name: '尼加拉瓜'
                },
                {
                    id: 53328,
                    name: '尼日尔'
                },
                {
                    id: 53329,
                    name: '尼日利亚'
                },
                {
                    id: 53330,
                    name: '挪威'
                },
                {
                    id: 53331,
                    name: '帕劳'
                },
                {
                    id: 53332,
                    name: '葡萄牙'
                },
                {
                    id: 53333,
                    name: '日本'
                },
                {
                    id: 53334,
                    name: '瑞典'
                },
                {
                    id: 53335,
                    name: '瑞士'
                }
            ],
            'S': [
                {
                    id: 53340,
                    name: '萨尔瓦多'
                },
                {
                    id: 53342,
                    name: '萨摩亚'
                },
                {
                    id: 53345,
                    name: '塞尔维亚'
                },
                {
                    id: 53348,
                    name: '塞拉利昂'
                },
                {
                    id: 53351,
                    name: '塞内加尔'
                },
                {
                    id: 53358,
                    name: '塞浦路斯'
                },
                {
                    id: 53360,
                    name: '塞舌尔'
                },
                {
                    id: 53363,
                    name: '沙特阿拉伯'
                },
                {
                    id: 53369,
                    name: '圣卢西亚'
                },
                {
                    id: 53371,
                    name: '圣马力诺'
                },
                {
                    id: 53376,
                    name: '斯里兰卡'
                },
                {
                    id: 53378,
                    name: '斯洛伐克'
                },
                {
                    id: 53381,
                    name: '斯洛文尼亚'
                },
                {
                    id: 53383,
                    name: '斯威士兰'
                },
                {
                    id: 53385,
                    name: '苏丹'
                },
                {
                    id: 53388,
                    name: '苏里南'
                },
                {
                    id: 53393,
                    name: '索马里'
                },
                {
                    id: 53390,
                    name: '所罗门群岛'
                },
                {
                    id: 53366,
                    name: '圣基茨和尼维斯'
                },
                {
                    id: 53364,
                    name: '圣多美和普林西比'
                },
                {
                    id: 53373,
                    name: '圣文森特和格林纳丁斯'
                }
            ],
            'TW': [
                {
                    id: 53402,
                    name: '塔吉克斯坦'
                },
                {
                    id: 53404,
                    name: '泰国'
                },
                {
                    id: 53418,
                    name: '坦桑尼亚'
                },
                {
                    id: 53424,
                    name: '汤加'
                },
                {
                    id: 53431,
                    name: '突尼斯'
                },
                {
                    id: 53433,
                    name: '图瓦卢'
                },
                {
                    id: 53435,
                    name: '土耳其'
                },
                {
                    id: 53437,
                    name: '瓦努阿图'
                },
                {
                    id: 53438,
                    name: '危地马拉'
                },
                {
                    id: 53439,
                    name: '委内瑞拉'
                },
                {
                    id: 53441,
                    name: '文莱'
                },
                {
                    id: 53443,
                    name: '乌干达'
                },
                {
                    id: 53446,
                    name: '乌克兰'
                },
                {
                    id: 53448,
                    name: '乌拉圭'
                },
                {
                    id: 53450,
                    name: '乌兹别克斯坦'
                },
                {
                    id: 53429,
                    name: '特立尼达和多巴哥'
                },
                {
                    id: 53427,
                    name: '特克斯和凯科斯群岛'
                }
            ],
            'XYZ': [
                {
                    id: 53452,
                    name: '西班牙'
                },
                {
                    id: 53454,
                    name: '希腊'
                },
                {
                    id: 53456,
                    name: '新加坡'
                },
                {
                    id: 53462,
                    name: '新西兰'
                },
                {
                    id: 53465,
                    name: '匈牙利'
                },
                {
                    id: 53468,
                    name: '叙利亚'
                },
                {
                    id: 53469,
                    name: '牙买加'
                },
                {
                    id: 53470,
                    name: '亚美尼亚'
                },
                {
                    id: 53471,
                    name: '也门'
                },
                {
                    id: 53472,
                    name: '伊拉克'
                },
                {
                    id: 53473,
                    name: '伊朗'
                },
                {
                    id: 53474,
                    name: '以色列'
                },
                {
                    id: 53475,
                    name: '意大利'
                },
                {
                    id: 53477,
                    name: '印度'
                },
                {
                    id: 53478,
                    name: '印度尼西亚'
                },
                {
                    id: 53480,
                    name: '英国'
                },
                {
                    id: 53485,
                    name: '约旦'
                },
                {
                    id: 53487,
                    name: '越南'
                },
                {
                    id: 53488,
                    name: '赞比亚'
                },
                {
                    id: 53489,
                    name: '乍得'
                },
                {
                    id: 53490,
                    name: '智利'
                },
                {
                    id: 53492,
                    name: '中非'
                },
                {
                    id: 53459,
                    name: '新喀里多尼亚'
                },
                {
                    id: 53483,
                    name: '英属维尔京群岛'
                }
            ]
        }
    };;
    return common_provinceCityMap;
}
/* location.js for item.main end */